nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define CLKCTL1_UTICK1CLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL1_UTICK1CLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL1_UTICK1CLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1CLKDIV_DIV_SHIFT)) & CLKCTL1_UTICK1CLKDIV_DIV_MASK)

#define CLKCTL1_UTICK1CLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL1_UTICK1CLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_UTICK1CLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1CLKDIV_BUSY_SHIFT)) & CLKCTL1_UTICK1CLKDIV_BUSY_MASK)

#define CLKCTL1_UTICK1CLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL1_UTICK1CLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_UTICK1CLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1CLKDIV_RESET_SHIFT)) & CLKCTL1_UTICK1CLKDIV_RESET_MASK)

#define CLKCTL1_UTICK1CLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL1_UTICK1CLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_UTICK1CLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1CLKDIV_HALT_SHIFT)) & CLKCTL1_UTICK1CLKDIV_HALT_MASK)

#define CLKCTL1_UTICK1CLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL1_UTICK1CLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_UTICK1CLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_UTICK1CLKDIV_REQFLAG_SHIFT)) & CLKCTL1_UTICK1CLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name WWDT2FCLKSEL - WWDT2 Functional Clock Source Select */
/*! @{ */

#define CLKCTL1_WWDT2FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL1_WWDT2FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Clock Source Select
 *  0b00..1m_lposc
 *  0b01..Reserved
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL1_WWDT2FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_WWDT2FCLKSEL_SEL_SHIFT)) & CLKCTL1_WWDT2FCLKSEL_SEL_MASK)

#define CLKCTL1_WWDT2FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL1_WWDT2FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_WWDT2FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_WWDT2FCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_WWDT2FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name WWDT3FCLKSEL - WWDT3 Functional Clock Source Select */
/*! @{ */

#define CLKCTL1_WWDT3FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL1_WWDT3FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Clock Source Select
 *  0b00..1m_lposc
 *  0b01..Reserved
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL1_WWDT3FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_WWDT3FCLKSEL_SEL_SHIFT)) & CLKCTL1_WWDT3FCLKSEL_SEL_MASK)

#define CLKCTL1_WWDT3FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL1_WWDT3FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_WWDT3FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_WWDT3FCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_WWDT3FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SYSTICKFCLKSEL - SYSTICK Functional Clock Select Source */
/*! @{ */

#define CLKCTL1_SYSTICKFCLKSEL_SEL_MASK          (0x3U)
#define CLKCTL1_SYSTICKFCLKSEL_SEL_SHIFT         (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..1m_lposc
 *  0b10..wake32k_clk (switch to other clock source before VDD1_SENSE enters into the Deep Sleep Retention mode.)
 *  0b11..osc_clk
 */
#define CLKCTL1_SYSTICKFCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKSEL_SEL_SHIFT)) & CLKCTL1_SYSTICKFCLKSEL_SEL_MASK)

#define CLKCTL1_SYSTICKFCLKSEL_SEL_EN_MASK       (0x4U)
#define CLKCTL1_SYSTICKFCLKSEL_SEL_EN_SHIFT      (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_SYSTICKFCLKSEL_SEL_EN(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_SYSTICKFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SYSTICKFCLKDIV - SYSTICK Functional Clock Divider */
/*! @{ */

#define CLKCTL1_SYSTICKFCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL1_SYSTICKFCLKDIV_DIV_SHIFT         (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL1_SYSTICKFCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKDIV_DIV_SHIFT)) & CLKCTL1_SYSTICKFCLKDIV_DIV_MASK)

#define CLKCTL1_SYSTICKFCLKDIV_BUSY_MASK         (0x10000000U)
#define CLKCTL1_SYSTICKFCLKDIV_BUSY_SHIFT        (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SYSTICKFCLKDIV_BUSY(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKDIV_BUSY_SHIFT)) & CLKCTL1_SYSTICKFCLKDIV_BUSY_MASK)

#define CLKCTL1_SYSTICKFCLKDIV_RESET_MASK        (0x20000000U)
#define CLKCTL1_SYSTICKFCLKDIV_RESET_SHIFT       (29U)
/*! RESET - Systick Clock Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_SYSTICKFCLKDIV_RESET(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKDIV_RESET_SHIFT)) & CLKCTL1_SYSTICKFCLKDIV_RESET_MASK)

#define CLKCTL1_SYSTICKFCLKDIV_HALT_MASK         (0x40000000U)
#define CLKCTL1_SYSTICKFCLKDIV_HALT_SHIFT        (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_SYSTICKFCLKDIV_HALT(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKDIV_HALT_SHIFT)) & CLKCTL1_SYSTICKFCLKDIV_HALT_MASK)

#define CLKCTL1_SYSTICKFCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL1_SYSTICKFCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_SYSTICKFCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_SYSTICKFCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_SYSTICKFCLKDIV_REQFLAG_MASK)
/*! @} */

