nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
/*! @name CTIMERFCLKSEL - CTIMER5 Functional Clock Source Select..CTIMER7 Functional Clock Source Select */
/*! @{ */

#define CLKCTL1_CTIMERFCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL1_CTIMERFCLKSEL_SEL_SHIFT          (0U)
/*! SEL - CTIMER7 Functional Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..audio_clk
 *  0b10..fro2_max
 *  0b11..wake32k_clk
 */
#define CLKCTL1_CTIMERFCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERFCLKSEL_SEL_SHIFT)) & CLKCTL1_CTIMERFCLKSEL_SEL_MASK)

#define CLKCTL1_CTIMERFCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL1_CTIMERFCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_CTIMERFCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERFCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_CTIMERFCLKSEL_SEL_EN_MASK)
/*! @} */

/* The count of CLKCTL1_CTIMERFCLKSEL */
#define CLKCTL1_CTIMERFCLKSEL_COUNT              (3U)

/*! @name CTIMERCLKDIV - CTIMER5 Functional Clock Divider..CTIMER7 Functional Clock Divider */
/*! @{ */

#define CLKCTL1_CTIMERCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL1_CTIMERCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL1_CTIMERCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERCLKDIV_DIV_SHIFT)) & CLKCTL1_CTIMERCLKDIV_DIV_MASK)

#define CLKCTL1_CTIMERCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL1_CTIMERCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_CTIMERCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERCLKDIV_BUSY_SHIFT)) & CLKCTL1_CTIMERCLKDIV_BUSY_MASK)

#define CLKCTL1_CTIMERCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL1_CTIMERCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_CTIMERCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERCLKDIV_RESET_SHIFT)) & CLKCTL1_CTIMERCLKDIV_RESET_MASK)

#define CLKCTL1_CTIMERCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL1_CTIMERCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_CTIMERCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERCLKDIV_HALT_SHIFT)) & CLKCTL1_CTIMERCLKDIV_HALT_MASK)

#define CLKCTL1_CTIMERCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL1_CTIMERCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished
 *  0b1..A change is being made to the divider value
 */
#define CLKCTL1_CTIMERCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_CTIMERCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_CTIMERCLKDIV_REQFLAG_MASK)
/*! @} */

/* The count of CLKCTL1_CTIMERCLKDIV */
#define CLKCTL1_CTIMERCLKDIV_COUNT               (3U)

/*! @name I3C23FCLKSEL - I3C2 and I3C3 Functional Clock Source Select */
/*! @{ */

#define CLKCTL1_I3C23FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL1_I3C23FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - I3C2 and I3C3 Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_max
 *  0b10..fro1_div8
 *  0b11..osc_clk
 */
#define CLKCTL1_I3C23FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKSEL_SEL_SHIFT)) & CLKCTL1_I3C23FCLKSEL_SEL_MASK)

#define CLKCTL1_I3C23FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL1_I3C23FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_I3C23FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_I3C23FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name I3C23FCLKDIV - I3C2 and I3C3 Functional Clock Divider */
/*! @{ */

#define CLKCTL1_I3C23FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL1_I3C23FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - I3C2 and I3C3 Clock Divider Value */
#define CLKCTL1_I3C23FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKDIV_DIV_SHIFT)) & CLKCTL1_I3C23FCLKDIV_DIV_MASK)

#define CLKCTL1_I3C23FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL1_I3C23FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL1_I3C23FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKDIV_BUSY_SHIFT)) & CLKCTL1_I3C23FCLKDIV_BUSY_MASK)

#define CLKCTL1_I3C23FCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL1_I3C23FCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL1_I3C23FCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKDIV_RESET_SHIFT)) & CLKCTL1_I3C23FCLKDIV_RESET_MASK)

#define CLKCTL1_I3C23FCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL1_I3C23FCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL1_I3C23FCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKDIV_HALT_SHIFT)) & CLKCTL1_I3C23FCLKDIV_HALT_MASK)

#define CLKCTL1_I3C23FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL1_I3C23FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The Divider change has been finished (The clock to be divided must be running for this status to change).
 *  0b1..The divider value is being changed.
 */
#define CLKCTL1_I3C23FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_I3C23FCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_I3C23FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name FCFCLKSEL - LP_FLEXCOMM17 Clock Source Select..LP_FLEXCOMM20 Clock Source Select */
/*! @{ */

#define CLKCTL1_FCFCLKSEL_SEL_MASK               (0x3U)
#define CLKCTL1_FCFCLKSEL_SEL_SHIFT              (0U)
/*! SEL - LP_FLEXCOMM20 Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_max
 *  0b10..fro1_max
 *  0b11..wake32k_clk
 */
#define CLKCTL1_FCFCLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKSEL_SEL_SHIFT)) & CLKCTL1_FCFCLKSEL_SEL_MASK)

#define CLKCTL1_FCFCLKSEL_SEL_EN_MASK            (0x4U)
#define CLKCTL1_FCFCLKSEL_SEL_EN_SHIFT           (2U)
/*! SEL_EN - Clock MUX Output Enable
 *  0b0..Output of clkmux is gated.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL1_FCFCLKSEL_SEL_EN(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FCFCLKSEL_SEL_EN_SHIFT)) & CLKCTL1_FCFCLKSEL_SEL_EN_MASK)
/*! @} */

