nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
/*! @name LPOSCCTL0 - Low Power Oscillator Control 0 */
/*! @{ */

#define CLKCTL3_LPOSCCTL0_CLKRDY_MASK            (0x80000000U)
#define CLKCTL3_LPOSCCTL0_CLKRDY_SHIFT           (31U)
/*! CLKRDY - LPOSC Clock Ready
 *  0b0..LPOSC clock is not ready.
 *  0b1..LPOSC clock is ready.
 */
#define CLKCTL3_LPOSCCTL0_CLKRDY(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_LPOSCCTL0_CLKRDY_SHIFT)) & CLKCTL3_LPOSCCTL0_CLKRDY_MASK)
/*! @} */

/*! @name SENSEBASECLKSEL - VDD1_SENSE Base Clock Select Source */
/*! @{ */

#define CLKCTL3_SENSEBASECLKSEL_SEL_MASK         (0x3U)
#define CLKCTL3_SENSEBASECLKSEL_SEL_SHIFT        (0U)
/*! SEL - Clock Source Selection
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro2_div3
 *  0b11..1m_lposc
 */
#define CLKCTL3_SENSEBASECLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSEBASECLKSEL_SEL_SHIFT)) & CLKCTL3_SENSEBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name FRO2CLKSTATUS - FRO_TUNER2 Clock Status */
/*! @{ */

#define CLKCTL3_FRO2CLKSTATUS_CLK_OK_MASK        (0x1U)
#define CLKCTL3_FRO2CLKSTATUS_CLK_OK_SHIFT       (0U)
/*! CLK_OK - FRO_TUNER2 Clock OK
 *  0b0..FRO_TUNER2 clock has not yet reached its final frequency.
 *  0b1..FRO_TUNER2 clock has reached its final frequency.
 */
#define CLKCTL3_FRO2CLKSTATUS_CLK_OK(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2CLKSTATUS_CLK_OK_SHIFT)) & CLKCTL3_FRO2CLKSTATUS_CLK_OK_MASK)
/*! @} */

/*! @name FRO2MAXDOMAINEN - FRO2MAX Clock Domain Enable */
/*! @{ */

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_CMPT_MASK (0x1U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_CMPT_SHIFT (0U)
/*! FRO2MAX_OF_CMPT - Enable fro2_max Clock Control of VDD2_COMP Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_CMPT(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_CMPT_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_CMPT_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_SENSE_MASK (0x2U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_SENSE_SHIFT (1U)
/*! FRO2MAX_OF_SENSE - Enable fro2_max Clock Control of VDD1_SENSE Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_SENSE(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_SENSE_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_SENSE_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_DSP_MASK (0x4U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_DSP_SHIFT (2U)
/*! FRO2MAX_OF_VDD2_DSP - Enable fro2_max Clock Control of VDD2_DSP Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_DSP(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_DSP_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_DSP_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MD2_MASK (0x8U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MD2_SHIFT (3U)
/*! FRO2MAX_OF_MD2 - Enable fro2_max Clock Control of VDD2_MEDIA Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MD2(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MD2_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MD2_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MDN_MASK (0x10U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MDN_SHIFT (4U)
/*! FRO2MAX_OF_MDN - Enable fro2_max Clock Control of VDDN_MEDIA Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MDN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MDN_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_MDN_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_COM_MASK (0x20U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_COM_SHIFT (5U)
/*! FRO2MAX_OF_VDD2_COM - Enable fro2_max Clock Control of VDD2_COM Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_COM(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_COM_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_VDD2_COM_MASK)

#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_COMN_MASK (0x40U)
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_COMN_SHIFT (6U)
/*! FRO2MAX_OF_COMN - Enable fro2_max Clock Control of VDDN_COM Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_COMN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_COMN_SHIFT)) & CLKCTL3_FRO2MAXDOMAINEN_FRO2MAX_OF_COMN_MASK)
/*! @} */

/*! @name SENSEMAINCLKDIV - VDD1_SENSE Main Clock Divider */
/*! @{ */

#define CLKCTL3_SENSEMAINCLKDIV_DIV_MASK         (0xFFU)
#define CLKCTL3_SENSEMAINCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL3_SENSEMAINCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSEMAINCLKDIV_DIV_SHIFT)) & CLKCTL3_SENSEMAINCLKDIV_DIV_MASK)

#define CLKCTL3_SENSEMAINCLKDIV_BUSY_MASK        (0x10000000U)
#define CLKCTL3_SENSEMAINCLKDIV_BUSY_SHIFT       (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SENSEMAINCLKDIV_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSEMAINCLKDIV_BUSY_SHIFT)) & CLKCTL3_SENSEMAINCLKDIV_BUSY_MASK)

#define CLKCTL3_SENSEMAINCLKDIV_REQFLAG_MASK     (0x80000000U)
#define CLKCTL3_SENSEMAINCLKDIV_REQFLAG_SHIFT    (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL3_SENSEMAINCLKDIV_REQFLAG(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSEMAINCLKDIV_REQFLAG_SHIFT)) & CLKCTL3_SENSEMAINCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name MAINCLKSEL - VDD1_SENSE Main Clock Source Select */
/*! @{ */

#define CLKCTL3_MAINCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL3_MAINCLKSEL_SEL_SHIFT             (0U)
/*! SEL - VDD1_SENSE Main Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_max
 *  0b10..audio_pll_pfd3
 *  0b11..fro1_max
 */
#define CLKCTL3_MAINCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL3_MAINCLKSEL_SEL_SHIFT)) & CLKCTL3_MAINCLKSEL_SEL_MASK)
/*! @} */

/*! @name SENSERAMCLKSEL - VDD1_SENSE RAM Clock Source Select */
/*! @{ */

#define CLKCTL3_SENSERAMCLKSEL_SEL_MASK          (0x3U)
#define CLKCTL3_SENSERAMCLKSEL_SEL_SHIFT         (0U)
/*! SEL - VDD1_SENSE RAM Clock Source Select
 *  0b00..baseclk_sense
 *  0b01..fro2_max
 *  0b10..audio_pll_pfd2
 *  0b11..fro1_max
 */
#define CLKCTL3_SENSERAMCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSERAMCLKSEL_SEL_SHIFT)) & CLKCTL3_SENSERAMCLKSEL_SEL_MASK)
/*! @} */

/*! @name SENSERAMCLKDIV - VDD1_SENSE RAM Clock Divider */
/*! @{ */

#define CLKCTL3_SENSERAMCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL3_SENSERAMCLKDIV_DIV_SHIFT         (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL3_SENSERAMCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSERAMCLKDIV_DIV_SHIFT)) & CLKCTL3_SENSERAMCLKDIV_DIV_MASK)

#define CLKCTL3_SENSERAMCLKDIV_BUSY_MASK         (0x10000000U)
#define CLKCTL3_SENSERAMCLKDIV_BUSY_SHIFT        (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL3_SENSERAMCLKDIV_BUSY(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_SENSERAMCLKDIV_BUSY_SHIFT)) & CLKCTL3_SENSERAMCLKDIV_BUSY_MASK)

