nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define CLKCTL4_VGPUCLKSEL_SEL_EN_MASK           (0x4U)
#define CLKCTL4_VGPUCLKSEL_SEL_EN_SHIFT          (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for VGPU clock.
 *  0b1..Enables mux output for VGPU clock.
 */
#define CLKCTL4_VGPUCLKSEL_SEL_EN(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_VGPUCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name VGPUCLKDIV - VGPU Clock Divider */
/*! @{ */

#define CLKCTL4_VGPUCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL4_VGPUCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_VGPUCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKDIV_DIV_SHIFT)) & CLKCTL4_VGPUCLKDIV_DIV_MASK)

#define CLKCTL4_VGPUCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL4_VGPUCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_VGPUCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKDIV_BUSY_SHIFT)) & CLKCTL4_VGPUCLKDIV_BUSY_MASK)

#define CLKCTL4_VGPUCLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL4_VGPUCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_VGPUCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKDIV_RESET_SHIFT)) & CLKCTL4_VGPUCLKDIV_RESET_MASK)

#define CLKCTL4_VGPUCLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL4_VGPUCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_VGPUCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKDIV_HALT_SHIFT)) & CLKCTL4_VGPUCLKDIV_HALT_MASK)

#define CLKCTL4_VGPUCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL4_VGPUCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_VGPUCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_VGPUCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name LPSPI14CLKSEL - LPSPI14 Clock Source Select */
/*! @{ */

#define CLKCTL4_LPSPI14CLKSEL_SEL_MASK           (0x3U)
#define CLKCTL4_LPSPI14CLKSEL_SEL_SHIFT          (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..fro0_max
 *  0b10..main_pll_pfd0
 *  0b11..fro1_max
 */
#define CLKCTL4_LPSPI14CLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKSEL_SEL_SHIFT)) & CLKCTL4_LPSPI14CLKSEL_SEL_MASK)

#define CLKCTL4_LPSPI14CLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL4_LPSPI14CLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for LPSPI14 clock.
 *  0b1..Enables mux output for LPSPI14 clock.
 */
#define CLKCTL4_LPSPI14CLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKSEL_SEL_EN_SHIFT)) & CLKCTL4_LPSPI14CLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name LPSPI14CLKDIV - LPSPI14 Clock Divider */
/*! @{ */

#define CLKCTL4_LPSPI14CLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL4_LPSPI14CLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_LPSPI14CLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKDIV_DIV_SHIFT)) & CLKCTL4_LPSPI14CLKDIV_DIV_MASK)

#define CLKCTL4_LPSPI14CLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL4_LPSPI14CLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_LPSPI14CLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKDIV_BUSY_SHIFT)) & CLKCTL4_LPSPI14CLKDIV_BUSY_MASK)

#define CLKCTL4_LPSPI14CLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL4_LPSPI14CLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_LPSPI14CLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKDIV_RESET_SHIFT)) & CLKCTL4_LPSPI14CLKDIV_RESET_MASK)

#define CLKCTL4_LPSPI14CLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL4_LPSPI14CLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_LPSPI14CLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKDIV_HALT_SHIFT)) & CLKCTL4_LPSPI14CLKDIV_HALT_MASK)

#define CLKCTL4_LPSPI14CLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL4_LPSPI14CLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_LPSPI14CLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI14CLKDIV_REQFLAG_SHIFT)) & CLKCTL4_LPSPI14CLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name LPSPI16CLKSEL - LPSPI16 Clock Source Select */
/*! @{ */

#define CLKCTL4_LPSPI16CLKSEL_SEL_MASK           (0x3U)
#define CLKCTL4_LPSPI16CLKSEL_SEL_SHIFT          (0U)
/*! SEL - LPSPI16 Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..fro0_max
 *  0b10..main_pll_pfd0
 *  0b11..fro1_max
 */
#define CLKCTL4_LPSPI16CLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKSEL_SEL_SHIFT)) & CLKCTL4_LPSPI16CLKSEL_SEL_MASK)

#define CLKCTL4_LPSPI16CLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL4_LPSPI16CLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for LPSPI16 clock.
 *  0b1..Enables mux output for LPSPI16 clock.
 */
#define CLKCTL4_LPSPI16CLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKSEL_SEL_EN_SHIFT)) & CLKCTL4_LPSPI16CLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name LPSPI16CLKDIV - LPSPI16 Clock Divider */
/*! @{ */

#define CLKCTL4_LPSPI16CLKDIV_DIV_MASK           (0xFFU)
#define CLKCTL4_LPSPI16CLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_LPSPI16CLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKDIV_DIV_SHIFT)) & CLKCTL4_LPSPI16CLKDIV_DIV_MASK)

#define CLKCTL4_LPSPI16CLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL4_LPSPI16CLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_LPSPI16CLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKDIV_BUSY_SHIFT)) & CLKCTL4_LPSPI16CLKDIV_BUSY_MASK)

