nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define CLKCTL4_LPSPI16CLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL4_LPSPI16CLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_LPSPI16CLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKDIV_RESET_SHIFT)) & CLKCTL4_LPSPI16CLKDIV_RESET_MASK)

#define CLKCTL4_LPSPI16CLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL4_LPSPI16CLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_LPSPI16CLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKDIV_HALT_SHIFT)) & CLKCTL4_LPSPI16CLKDIV_HALT_MASK)

#define CLKCTL4_LPSPI16CLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL4_LPSPI16CLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_LPSPI16CLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LPSPI16CLKDIV_REQFLAG_SHIFT)) & CLKCTL4_LPSPI16CLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name FLEXIOCLKSEL - FLEXIO Clock Source Select */
/*! @{ */

#define CLKCTL4_FLEXIOCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL4_FLEXIOCLKSEL_SEL_SHIFT           (0U)
/*! SEL - FLEXIO Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..fro0_max
 *  0b10..fro1_max
 *  0b11..main_pll_pfd3
 */
#define CLKCTL4_FLEXIOCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKSEL_SEL_SHIFT)) & CLKCTL4_FLEXIOCLKSEL_SEL_MASK)

#define CLKCTL4_FLEXIOCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL4_FLEXIOCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for FLEXIO clock.
 *  0b1..Enables mux output for FLEXIO clock.
 */
#define CLKCTL4_FLEXIOCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_FLEXIOCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name FLEXIOCLKDIV - FLEXIO Clock Divider */
/*! @{ */

#define CLKCTL4_FLEXIOCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL4_FLEXIOCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_FLEXIOCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKDIV_DIV_SHIFT)) & CLKCTL4_FLEXIOCLKDIV_DIV_MASK)

#define CLKCTL4_FLEXIOCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL4_FLEXIOCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_FLEXIOCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKDIV_BUSY_SHIFT)) & CLKCTL4_FLEXIOCLKDIV_BUSY_MASK)

#define CLKCTL4_FLEXIOCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL4_FLEXIOCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_FLEXIOCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKDIV_RESET_SHIFT)) & CLKCTL4_FLEXIOCLKDIV_RESET_MASK)

#define CLKCTL4_FLEXIOCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL4_FLEXIOCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_FLEXIOCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKDIV_HALT_SHIFT)) & CLKCTL4_FLEXIOCLKDIV_HALT_MASK)

#define CLKCTL4_FLEXIOCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL4_FLEXIOCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_FLEXIOCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_FLEXIOCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_FLEXIOCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name LCDIFPIXELCLKSEL - LCDIF Pixel Clock Source Select */
/*! @{ */

#define CLKCTL4_LCDIFPIXELCLKSEL_SEL_MASK        (0x3U)
#define CLKCTL4_LCDIFPIXELCLKSEL_SEL_SHIFT       (0U)
/*! SEL - LCDIF Pixel Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..main_pll_pfd2
 *  0b10..fro0_max
 *  0b11..audio_pll_pfd1
 */
#define CLKCTL4_LCDIFPIXELCLKSEL_SEL(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKSEL_SEL_SHIFT)) & CLKCTL4_LCDIFPIXELCLKSEL_SEL_MASK)

#define CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN_MASK     (0x4U)
#define CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN_SHIFT    (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for LCDIF clock.
 *  0b1..Enables mux output for LCDIF clock.
 */
#define CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_LCDIFPIXELCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name LCDIFPIXELCLKDIV - LCDIF Pixel Clock Divider */
/*! @{ */

#define CLKCTL4_LCDIFPIXELCLKDIV_DIV_MASK        (0xFFU)
#define CLKCTL4_LCDIFPIXELCLKDIV_DIV_SHIFT       (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_LCDIFPIXELCLKDIV_DIV(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKDIV_DIV_SHIFT)) & CLKCTL4_LCDIFPIXELCLKDIV_DIV_MASK)

#define CLKCTL4_LCDIFPIXELCLKDIV_BUSY_MASK       (0x10000000U)
#define CLKCTL4_LCDIFPIXELCLKDIV_BUSY_SHIFT      (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_LCDIFPIXELCLKDIV_BUSY(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKDIV_BUSY_SHIFT)) & CLKCTL4_LCDIFPIXELCLKDIV_BUSY_MASK)

#define CLKCTL4_LCDIFPIXELCLKDIV_RESET_MASK      (0x20000000U)
#define CLKCTL4_LCDIFPIXELCLKDIV_RESET_SHIFT     (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_LCDIFPIXELCLKDIV_RESET(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKDIV_RESET_SHIFT)) & CLKCTL4_LCDIFPIXELCLKDIV_RESET_MASK)

