nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
/** LCDIF - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[8228];
  __IO uint32_t FRAMEBUFFERCONFIG0;                /**< Frame Buffer Configuration, offset: 0x2024 */
  __IO uint32_t FRAMEBUFFERADDRESS0;               /**< Frame Buffer Base Address, offset: 0x2028 */
  __IO uint32_t FRAMEBUFFERSTRIDE0;                /**< Frame Buffer Stride, offset: 0x202C */
       uint8_t RESERVED_1[4];
  __IO uint32_t DCTILEINCFG0;                      /**< Tile Input Configuration, offset: 0x2034 */
  __IO uint32_t DCTILEUVFRAMEBUFFERADR0;           /**< Frame Buffer Tiled UV Base Address, offset: 0x2038 */
  __IO uint32_t DCTILEUVFRAMEBUFFERSTR0;           /**< Frame Buffer Tiled UV Stride, offset: 0x203C */
       uint8_t RESERVED_2[24];
  __IO uint32_t FRAMEBUFFERBACKGROUND;             /**< Frame Buffer Background, offset: 0x2058 */
  __IO uint32_t FRAMEBUFFERCOLORKEY;               /**< Frame Buffer Color Keying Start Address, offset: 0x205C */
  __IO uint32_t FRAMEBUFFERCOLORKEYHIGH;           /**< Frame Buffer Color Key End Address, offset: 0x2060 */
  __IO uint32_t FRAMEBUFFERCLEARVALUE;             /**< Frame Buffer Clear Value, offset: 0x2064 */
  __IO uint32_t VIDEOTL;                           /**< Video Top Left Coordinate, offset: 0x2068 */
  __IO uint32_t FRAMEBUFFERSIZE;                   /**< Frame Buffer Size, offset: 0x206C */
  __IO uint32_t VIDEOGLOBALALPHA;                  /**< Video Global Alpha, offset: 0x2070 */
  __IO uint32_t BLENDSTACKORDER;                   /**< Blend Stack Order, offset: 0x2074 */
  __IO uint32_t VIDEOALPHABLENDCONFIG;             /**< Alpha Blending Configuration, offset: 0x2078 */
  __IO uint32_t OVERLAYCONFIG;                     /**< Overlay Configuration, offset: 0x207C */
  __IO uint32_t OVERLAYADDRESS;                    /**< Overlay Address, offset: 0x2080 */
  __IO uint32_t OVERLAYSTRIDE;                     /**< Overlay Stride, offset: 0x2084 */
  __IO uint32_t DCOVERLAYTILEINCFG;                /**< Tile Input Configuration, offset: 0x2088 */
  __IO uint32_t DCTILEUVOVERLAYADR;                /**< Tile Uv Overlay Address, offset: 0x208C */
  __IO uint32_t DCTILEUVOVERLAYSTR;                /**< Tile Uv Overlay Stride, offset: 0x2090 */
  __IO uint32_t OVERLAYTL;                         /**< Overlay Top Left, offset: 0x2094 */
  __IO uint32_t OVERLAYSIZE;                       /**< Overlay Size, offset: 0x2098 */
  __IO uint32_t OVERLAYCOLORKEY;                   /**< Overlay Color Keying Start Address, offset: 0x209C */
  __IO uint32_t OVERLAYCOLORKEYHIGH;               /**< Overlay Color Keying End Address, offset: 0x20A0 */
  __IO uint32_t OVERLAYALPHABLENDCONFIG;           /**< Overlay Alpha Blending Configuration, offset: 0x20A4 */
  __IO uint32_t OVERLAYGLOBALALPHA;                /**< Overlay Global Alpha, offset: 0x20A8 */
  __IO uint32_t OVERLAYCLEARVALUE;                 /**< Overlay Clear Value, offset: 0x20AC */
  __IO uint32_t OVERLAYCONFIG1;                    /**< Overlay Layer 1 Configuration, offset: 0x20B0 */
  __IO uint32_t OVERLAYADDRESS1;                   /**< Overlay Layer 1 Address, offset: 0x20B4 */
  __IO uint32_t OVERLAYSTRIDE1;                    /**< Overlay Layer 1 Stride, offset: 0x20B8 */
  __IO uint32_t OVERLAYTL1;                        /**< Overlay Layer 1 Top Left, offset: 0x20BC */
  __IO uint32_t OVERLAYSIZE1;                      /**< Overlay Layer 1 Size, offset: 0x20C0 */
  __IO uint32_t OVERLAYCOLORKEY1;                  /**< Overlay Layer 1 Color Keying Start Address, offset: 0x20C4 */
  __IO uint32_t OVERLAYCOLORKEYHIGH1;              /**< Overlay Layer 1 Color Keying End Address, offset: 0x20C8 */
  __IO uint32_t OVERLAYALPHABLENDCONFIG1;          /**< Overlay Layer 1 Alpha Blending Configuration, offset: 0x20CC */
  __IO uint32_t OVERLAYGLOBALALPHA1;               /**< Overlay Layer 1 Global Alpha, offset: 0x20D0 */
  __IO uint32_t OVERLAYCLEARVALUE1;                /**< Overlay Layer 1 Clear Value, offset: 0x20D4 */
       uint8_t RESERVED_3[8];
  __IO uint32_t DISPLAYDITHERTABLELOW0;            /**< Dither Lookup Table Low Threshold, offset: 0x20E0 */
  __IO uint32_t DISPLAYDITHERTABLEHIGH0;           /**< Dither Lookup Table High Threshold, offset: 0x20E4 */
  __IO uint32_t PANELCONFIG0;                      /**< Panel Configuration, offset: 0x20E8 */
  __IO uint32_t PANELCONTROL;                      /**< Panel Control, offset: 0x20EC */
  __IO uint32_t PANELFUNCTION;                     /**< Panel Function, offset: 0x20F0 */
  __O  uint32_t PANELWORKING;                      /**< Panel Working, offset: 0x20F4 */
  __I  uint32_t PANELSTATE;                        /**< Panel State, offset: 0x20F8 */
       uint8_t RESERVED_4[4];
  __IO uint32_t HDISPLAY0;                         /**< Horizontal Display Total and Visible Pixel Count, offset: 0x2100 */
  __IO uint32_t HSYNC0;                            /**< Horizontal Sync Counter, offset: 0x2104 */
       uint8_t RESERVED_5[8];
  __IO uint32_t VDISPLAY0;                         /**< Vertical Total and Visible Pixel Count, offset: 0x2110 */
  __IO uint32_t VSYNC0;                            /**< Vertical Sync Counter, offset: 0x2114 */
  __I  uint32_t DISPLAYCURRENTLOCATION0;           /**< Display Current Location, offset: 0x2118 */
  __O  uint32_t GAMMAINDEX0;                       /**< Gamma Index, offset: 0x211C */
  __O  uint32_t GAMMADATA0;                        /**< Gamma Data, offset: 0x2120 */
  __IO uint32_t CURSORCONFIG;                      /**< Cursor Configuration, offset: 0x2124 */
  __IO uint32_t CURSORADDRESS;                     /**< Cursor Base Address, offset: 0x2128 */
  __IO uint32_t CURSORLOCATION;                    /**< Cursor Location, offset: 0x212C */
  __IO uint32_t CURSORBACKGROUND;                  /**< Cursor Background Color, offset: 0x2130 */
  __IO uint32_t CURSORFOREGROUND;                  /**< Cursor Foreground Color, offset: 0x2134 */
  __I  uint32_t DISPLAYINTR;                       /**< Display Interrupt, offset: 0x2138 */
  __IO uint32_t DISPLAYINTRENABLE;                 /**< Display Interrupt Enable, offset: 0x213C */
  __IO uint32_t DBICONFIG0;                        /**< DBI Configuration, offset: 0x2140 */
  __O  uint32_t DBIIFRESET0;                       /**< DBI Interface Reset, offset: 0x2144 */
  __IO uint32_t DBIWRCHAR10;                       /**< DBI Write AC Characteristics 1, offset: 0x2148 */
  __IO uint32_t DBIWRCHAR20;                       /**< DBI Write AC Characteristics 2, offset: 0x214C */
  __O  uint32_t DBICMD0;                           /**< DBI Command Control, offset: 0x2150 */
  __IO uint32_t DPICONFIG0;                        /**< DPI Configuration, offset: 0x2154 */
       uint8_t RESERVED_6[8];
  __IO uint32_t SRCCONFIGENDIAN;                   /**< Source Endian Configuration, offset: 0x2160 */
  __O  uint32_t SOFTRESET;                         /**< Soft Reset, offset: 0x2164 */
  __IO uint32_t DCCONTROL;                         /**< Display Controller Control, offset: 0x2168 */
       uint8_t RESERVED_7[52];
  __IO uint32_t LAYERCLOCKGATE;                    /**< Layer Clock Gating, offset: 0x21A0 */
} LCDIF_Type;

/* ----------------------------------------------------------------------------
   -- LCDIF Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LCDIF_Register_Masks LCDIF Register Masks
 * @{
 */

