nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_MASK (0xC0U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_SHIFT (6U)
/*! SRC_BLENDING_MODE - Source Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the source color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_SRC_BLENDING_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_MASK (0x100U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_SHIFT (8U)
/*! SRC_ALPHA_FACTOR - Source Alpha Factor
 *  0b0..Do not generate the blending factor.
 *  0b1..Generates the blending factor.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_SRC_ALPHA_FACTOR_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_MASK (0x200U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_SHIFT (9U)
/*! DST_ALPHA_MODE - Destination Alpha Mode
 *  0b0..Normal destination alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_MASK (0xC00U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_SHIFT (10U)
/*! DST_GLOBAL_ALPHA_MODE - Destination Global Alpha Mode
 *  0b00..Normal destination alpha mode
 *  0b01..Global destination alpha mode
 *  0b10..Scaled (by the global alpha value) destination alpha mode
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_DST_GLOBAL_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_MASK (0x6000U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_SHIFT (13U)
/*! DST_BLENDING_MODE - Destination Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the destination color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_DST_BLENDING_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_MASK (0x8000U)
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_SHIFT (15U)
/*! DST_ALPHA_FACTOR - Destination Alpha Factor
 *  0b0..Do not generate the blending factor for destination alpha.
 *  0b1..Generates the blending factor for destination alpha.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG_DST_ALPHA_FACTOR_MASK)
/*! @} */

/*! @name OVERLAYGLOBALALPHA - Overlay Global Alpha */
/*! @{ */

#define LCDIF_OVERLAYGLOBALALPHA_SRC_ALPHA_MASK  (0xFFU)
#define LCDIF_OVERLAYGLOBALALPHA_SRC_ALPHA_SHIFT (0U)
/*! SRC_ALPHA - Source Alpha */
#define LCDIF_OVERLAYGLOBALALPHA_SRC_ALPHA(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYGLOBALALPHA_SRC_ALPHA_SHIFT)) & LCDIF_OVERLAYGLOBALALPHA_SRC_ALPHA_MASK)

#define LCDIF_OVERLAYGLOBALALPHA_DST_ALPHA_MASK  (0xFF00U)
#define LCDIF_OVERLAYGLOBALALPHA_DST_ALPHA_SHIFT (8U)
/*! DST_ALPHA - Destination Alpha */
#define LCDIF_OVERLAYGLOBALALPHA_DST_ALPHA(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYGLOBALALPHA_DST_ALPHA_SHIFT)) & LCDIF_OVERLAYGLOBALALPHA_DST_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYCLEARVALUE - Overlay Clear Value */
/*! @{ */

#define LCDIF_OVERLAYCLEARVALUE_BLUE_MASK        (0xFFU)
#define LCDIF_OVERLAYCLEARVALUE_BLUE_SHIFT       (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCLEARVALUE_BLUE(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE_BLUE_SHIFT)) & LCDIF_OVERLAYCLEARVALUE_BLUE_MASK)

#define LCDIF_OVERLAYCLEARVALUE_GREEN_MASK       (0xFF00U)
#define LCDIF_OVERLAYCLEARVALUE_GREEN_SHIFT      (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCLEARVALUE_GREEN(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE_GREEN_SHIFT)) & LCDIF_OVERLAYCLEARVALUE_GREEN_MASK)

#define LCDIF_OVERLAYCLEARVALUE_RED_MASK         (0xFF0000U)
#define LCDIF_OVERLAYCLEARVALUE_RED_SHIFT        (16U)
/*! RED - Red */
#define LCDIF_OVERLAYCLEARVALUE_RED(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE_RED_SHIFT)) & LCDIF_OVERLAYCLEARVALUE_RED_MASK)

#define LCDIF_OVERLAYCLEARVALUE_ALPHA_MASK       (0xFF000000U)
#define LCDIF_OVERLAYCLEARVALUE_ALPHA_SHIFT      (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCLEARVALUE_ALPHA(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE_ALPHA_SHIFT)) & LCDIF_OVERLAYCLEARVALUE_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYCONFIG1 - Overlay Layer 1 Configuration */
/*! @{ */

#define LCDIF_OVERLAYCONFIG1_FORMAT_MASK         (0x7U)
#define LCDIF_OVERLAYCONFIG1_FORMAT_SHIFT        (0U)
/*! FORMAT - Input Format
 *  0b000..No overlay
 *  0b001..Sets the input format to A4R4G4B4.
 *  0b010..Sets the input format to A1R5G5B5.
 *  0b011..Sets the input format to R5G6B5.
 *  0b100..Sets the input format to A8R8G8B8.
 *  0b101..Sets the input format to R8G8B8.
 *  0b110..Sets the input format to A8R5G6B5.
 */
#define LCDIF_OVERLAYCONFIG1_FORMAT(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_FORMAT_SHIFT)) & LCDIF_OVERLAYCONFIG1_FORMAT_MASK)

#define LCDIF_OVERLAYCONFIG1_ENABLE_MASK         (0x8U)
#define LCDIF_OVERLAYCONFIG1_ENABLE_SHIFT        (3U)
/*! ENABLE - Enable
 *  0b0..Disables the overlay layer 1.
 *  0b1..Enables the overlay layer 1.
 */
#define LCDIF_OVERLAYCONFIG1_ENABLE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_ENABLE_SHIFT)) & LCDIF_OVERLAYCONFIG1_ENABLE_MASK)

