nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define LCDIF_OVERLAYCONFIG1_CLEAR_EN_MASK       (0x20U)
#define LCDIF_OVERLAYCONFIG1_CLEAR_EN_SHIFT      (5U)
/*! CLEAR_EN - Enable Clear
 *  0b0..Disables clearing the overlay layer 1.
 *  0b1..Enables clearing the overlay layer 1.
 */
#define LCDIF_OVERLAYCONFIG1_CLEAR_EN(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_CLEAR_EN_SHIFT)) & LCDIF_OVERLAYCONFIG1_CLEAR_EN_MASK)

#define LCDIF_OVERLAYCONFIG1_SWIZZLE_MASK        (0x60000U)
#define LCDIF_OVERLAYCONFIG1_SWIZZLE_SHIFT       (17U)
/*! SWIZZLE - RGB Swizzle
 *  0b00..Input pixel in ARGB format order
 *  0b01..Input pixel in RGBA format order
 *  0b10..Input pixel in ABGR format order
 *  0b11..Input pixel in BGRA format order
 */
#define LCDIF_OVERLAYCONFIG1_SWIZZLE(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_SWIZZLE_SHIFT)) & LCDIF_OVERLAYCONFIG1_SWIZZLE_MASK)

#define LCDIF_OVERLAYCONFIG1_COLOR_KEY_EN_MASK   (0x100000U)
#define LCDIF_OVERLAYCONFIG1_COLOR_KEY_EN_SHIFT  (20U)
/*! COLOR_KEY_EN - Enable Color Keying
 *  0b0..Disables color keying.
 *  0b1..Enables color keying.
 */
#define LCDIF_OVERLAYCONFIG1_COLOR_KEY_EN(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_COLOR_KEY_EN_SHIFT)) & LCDIF_OVERLAYCONFIG1_COLOR_KEY_EN_MASK)

#define LCDIF_OVERLAYCONFIG1_DEC_MODE_MASK       (0xE00000U)
#define LCDIF_OVERLAYCONFIG1_DEC_MODE_SHIFT      (21U)
/*! DEC_MODE - Decompression Mode
 *  0b000..Disables decompression.
 *  0b001..Enables non_subsample decompression mode.
 *  0b010..Enables horizontal subsample decompression mode.
 *  0b011..Enables horizontal and vertical subsample decompression mode.
 *  0b100..Enables ETC2 decompression mode.
 */
#define LCDIF_OVERLAYCONFIG1_DEC_MODE(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_DEC_MODE_SHIFT)) & LCDIF_OVERLAYCONFIG1_DEC_MODE_MASK)

#define LCDIF_OVERLAYCONFIG1_ROT_ANGLE_MASK      (0x7000000U)
#define LCDIF_OVERLAYCONFIG1_ROT_ANGLE_SHIFT     (24U)
/*! ROT_ANGLE - Rotation Angle
 *  0b000..Sets the rotation angle to 0 degree.
 *  0b010..Sets the rotation angle to 180 degree.
 *  0b100..Flips horizontal
 *  0b101..Flips vertical
 */
#define LCDIF_OVERLAYCONFIG1_ROT_ANGLE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCONFIG1_ROT_ANGLE_SHIFT)) & LCDIF_OVERLAYCONFIG1_ROT_ANGLE_MASK)
/*! @} */

/*! @name OVERLAYADDRESS1 - Overlay Layer 1 Address */
/*! @{ */

#define LCDIF_OVERLAYADDRESS1_ADDRESS_MASK       (0xFFFFFFFFU)
#define LCDIF_OVERLAYADDRESS1_ADDRESS_SHIFT      (0U)
/*! ADDRESS - Start Address */
#define LCDIF_OVERLAYADDRESS1_ADDRESS(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYADDRESS1_ADDRESS_SHIFT)) & LCDIF_OVERLAYADDRESS1_ADDRESS_MASK)
/*! @} */

/*! @name OVERLAYSTRIDE1 - Overlay Layer 1 Stride */
/*! @{ */

#define LCDIF_OVERLAYSTRIDE1_STRIDE_MASK         (0x1FFFFU)
#define LCDIF_OVERLAYSTRIDE1_STRIDE_SHIFT        (0U)
/*! STRIDE - Stride of Overlay Layer 1 */
#define LCDIF_OVERLAYSTRIDE1_STRIDE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSTRIDE1_STRIDE_SHIFT)) & LCDIF_OVERLAYSTRIDE1_STRIDE_MASK)
/*! @} */

/*! @name OVERLAYTL1 - Overlay Layer 1 Top Left */
/*! @{ */

#define LCDIF_OVERLAYTL1_X_MASK                  (0xFFFU)
#define LCDIF_OVERLAYTL1_X_SHIFT                 (0U)
/*! X - Left Boundary */
#define LCDIF_OVERLAYTL1_X(x)                    (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYTL1_X_SHIFT)) & LCDIF_OVERLAYTL1_X_MASK)

#define LCDIF_OVERLAYTL1_Y_MASK                  (0xFFF0000U)
#define LCDIF_OVERLAYTL1_Y_SHIFT                 (16U)
/*! Y - Top boundary */
#define LCDIF_OVERLAYTL1_Y(x)                    (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYTL1_Y_SHIFT)) & LCDIF_OVERLAYTL1_Y_MASK)
/*! @} */

/*! @name OVERLAYSIZE1 - Overlay Layer 1 Size */
/*! @{ */

#define LCDIF_OVERLAYSIZE1_WIDTH_MASK            (0xFFFU)
#define LCDIF_OVERLAYSIZE1_WIDTH_SHIFT           (0U)
/*! WIDTH - Width */
#define LCDIF_OVERLAYSIZE1_WIDTH(x)              (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSIZE1_WIDTH_SHIFT)) & LCDIF_OVERLAYSIZE1_WIDTH_MASK)

#define LCDIF_OVERLAYSIZE1_HEIGHT_MASK           (0xFFF0000U)
#define LCDIF_OVERLAYSIZE1_HEIGHT_SHIFT          (16U)
/*! HEIGHT - Height */
#define LCDIF_OVERLAYSIZE1_HEIGHT(x)             (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYSIZE1_HEIGHT_SHIFT)) & LCDIF_OVERLAYSIZE1_HEIGHT_MASK)
/*! @} */

/*! @name OVERLAYCOLORKEY1 - Overlay Layer 1 Color Keying Start Address */
/*! @{ */

#define LCDIF_OVERLAYCOLORKEY1_BLUE_MASK         (0xFFU)
#define LCDIF_OVERLAYCOLORKEY1_BLUE_SHIFT        (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCOLORKEY1_BLUE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY1_BLUE_SHIFT)) & LCDIF_OVERLAYCOLORKEY1_BLUE_MASK)

#define LCDIF_OVERLAYCOLORKEY1_GREEN_MASK        (0xFF00U)
#define LCDIF_OVERLAYCOLORKEY1_GREEN_SHIFT       (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCOLORKEY1_GREEN(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY1_GREEN_SHIFT)) & LCDIF_OVERLAYCOLORKEY1_GREEN_MASK)

#define LCDIF_OVERLAYCOLORKEY1_RED_MASK          (0xFF0000U)
#define LCDIF_OVERLAYCOLORKEY1_RED_SHIFT         (16U)
/*! RED - red */
#define LCDIF_OVERLAYCOLORKEY1_RED(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY1_RED_SHIFT)) & LCDIF_OVERLAYCOLORKEY1_RED_MASK)

#define LCDIF_OVERLAYCOLORKEY1_ALPHA_MASK        (0xFF000000U)
#define LCDIF_OVERLAYCOLORKEY1_ALPHA_SHIFT       (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCOLORKEY1_ALPHA(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEY1_ALPHA_SHIFT)) & LCDIF_OVERLAYCOLORKEY1_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYCOLORKEYHIGH1 - Overlay Layer 1 Color Keying End Address */
/*! @{ */

#define LCDIF_OVERLAYCOLORKEYHIGH1_BLUE_MASK     (0xFFU)
#define LCDIF_OVERLAYCOLORKEYHIGH1_BLUE_SHIFT    (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCOLORKEYHIGH1_BLUE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH1_BLUE_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH1_BLUE_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH1_GREEN_MASK    (0xFF00U)
#define LCDIF_OVERLAYCOLORKEYHIGH1_GREEN_SHIFT   (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCOLORKEYHIGH1_GREEN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH1_GREEN_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH1_GREEN_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH1_RED_MASK      (0xFF0000U)
#define LCDIF_OVERLAYCOLORKEYHIGH1_RED_SHIFT     (16U)
/*! RED - red */
#define LCDIF_OVERLAYCOLORKEYHIGH1_RED(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH1_RED_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH1_RED_MASK)

#define LCDIF_OVERLAYCOLORKEYHIGH1_ALPHA_MASK    (0xFF000000U)
#define LCDIF_OVERLAYCOLORKEYHIGH1_ALPHA_SHIFT   (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCOLORKEYHIGH1_ALPHA(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCOLORKEYHIGH1_ALPHA_SHIFT)) & LCDIF_OVERLAYCOLORKEYHIGH1_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYALPHABLENDCONFIG1 - Overlay Layer 1 Alpha Blending Configuration */
/*! @{ */

#define LCDIF_OVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_MASK (0x1U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_SHIFT (0U)
/*! ALPHA_BLEND - Alpha Blend
 *  0b0..Disables alpha blending for the overlay layer 1.
 *  0b1..Enables alpha blending for the overlay layer 1.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_ALPHA_BLEND(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_ALPHA_BLEND_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_MASK (0x2U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_SHIFT (1U)
/*! SRC_ALPHA_MODE - Source Alpha Mode
 *  0b0..Normal alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_MASK (0x18U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_SHIFT (3U)
/*! SRC_GLOBAL_ALPHA_MODE - Source Global Alpha Mode
 *  0b00..Normal source alpha mode
 *  0b01..Global source alpha mode
 *  0b10..Scaled (by the global alpha value) source alpha mode
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_GLOBAL_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_MASK (0xC0U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_SHIFT (6U)
/*! SRC_BLENDING_MODE - Source Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the source color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_BLENDING_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_MASK (0x100U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_SHIFT (8U)
/*! SRC_ALPHA_FACTOR - Source Alpha Factor
 *  0b0..Do not generate the blending factor for source alpha for the overlay layer 1.
 *  0b1..Generates the blending factor for source alpha for the overlay layer 1.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_SRC_ALPHA_FACTOR_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_MASK (0x200U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_SHIFT (9U)
/*! DST_ALPHA_MODE - Destination Alpha Mode
 *  0b0..Normal alpha mode
 *  0b1..Inversed alpha mode if the internal alpha rule needs to be followed
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_MASK (0xC00U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_SHIFT (10U)
/*! DST_GLOBAL_ALPHA_MODE - Destination Global Alpha Mode
 *  0b00..Normal destination alpha mode
 *  0b01..Global destination alpha mode
 *  0b10..Scaled (by the global alpha value) destination alpha mode
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_DST_GLOBAL_ALPHA_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_MASK (0x6000U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_SHIFT (13U)
/*! DST_BLENDING_MODE - Destination Blending Mode
 *  0b00..Each component of the color is multiplied by (0, 0, 0,0).
 *  0b01..Each component of the color is multiplied by (1, 1, 1,1).
 *  0b10..Normal as the result color is the source color
 *  0b11..Not affected by the color of the underlying pixel
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_DST_BLENDING_MODE_MASK)

#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_MASK (0x8000U)
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_SHIFT (15U)
/*! DST_ALPHA_FACTOR - DST Alpha Factor
 *  0b0..Do not generate the blending factor for destination alpha for the overlay layer 1.
 *  0b1..Generates the blending factor for destination alpha for the overlay layer 1.
 */
#define LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_SHIFT)) & LCDIF_OVERLAYALPHABLENDCONFIG1_DST_ALPHA_FACTOR_MASK)
/*! @} */

/*! @name OVERLAYGLOBALALPHA1 - Overlay Layer 1 Global Alpha */
/*! @{ */

#define LCDIF_OVERLAYGLOBALALPHA1_SRC_ALPHA_MASK (0xFFU)
#define LCDIF_OVERLAYGLOBALALPHA1_SRC_ALPHA_SHIFT (0U)
/*! SRC_ALPHA - Source Alpha */
#define LCDIF_OVERLAYGLOBALALPHA1_SRC_ALPHA(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYGLOBALALPHA1_SRC_ALPHA_SHIFT)) & LCDIF_OVERLAYGLOBALALPHA1_SRC_ALPHA_MASK)

#define LCDIF_OVERLAYGLOBALALPHA1_DST_ALPHA_MASK (0xFF00U)
#define LCDIF_OVERLAYGLOBALALPHA1_DST_ALPHA_SHIFT (8U)
/*! DST_ALPHA - Destination Alpha */
#define LCDIF_OVERLAYGLOBALALPHA1_DST_ALPHA(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYGLOBALALPHA1_DST_ALPHA_SHIFT)) & LCDIF_OVERLAYGLOBALALPHA1_DST_ALPHA_MASK)
/*! @} */

/*! @name OVERLAYCLEARVALUE1 - Overlay Layer 1 Clear Value */
/*! @{ */

#define LCDIF_OVERLAYCLEARVALUE1_BLUE_MASK       (0xFFU)
#define LCDIF_OVERLAYCLEARVALUE1_BLUE_SHIFT      (0U)
/*! BLUE - Blue */
#define LCDIF_OVERLAYCLEARVALUE1_BLUE(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE1_BLUE_SHIFT)) & LCDIF_OVERLAYCLEARVALUE1_BLUE_MASK)

#define LCDIF_OVERLAYCLEARVALUE1_GREEN_MASK      (0xFF00U)
#define LCDIF_OVERLAYCLEARVALUE1_GREEN_SHIFT     (8U)
/*! GREEN - Green */
#define LCDIF_OVERLAYCLEARVALUE1_GREEN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE1_GREEN_SHIFT)) & LCDIF_OVERLAYCLEARVALUE1_GREEN_MASK)

#define LCDIF_OVERLAYCLEARVALUE1_RED_MASK        (0xFF0000U)
#define LCDIF_OVERLAYCLEARVALUE1_RED_SHIFT       (16U)
/*! RED - Red */
#define LCDIF_OVERLAYCLEARVALUE1_RED(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE1_RED_SHIFT)) & LCDIF_OVERLAYCLEARVALUE1_RED_MASK)

#define LCDIF_OVERLAYCLEARVALUE1_ALPHA_MASK      (0xFF000000U)
#define LCDIF_OVERLAYCLEARVALUE1_ALPHA_SHIFT     (24U)
/*! ALPHA - Alpha */
#define LCDIF_OVERLAYCLEARVALUE1_ALPHA(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_OVERLAYCLEARVALUE1_ALPHA_SHIFT)) & LCDIF_OVERLAYCLEARVALUE1_ALPHA_MASK)
/*! @} */

/*! @name DISPLAYDITHERTABLELOW0 - Dither Lookup Table Low Threshold */
/*! @{ */

#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_MASK  (0xFU)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_SHIFT (0U)
/*! Y0_X0 - Y0_X0 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_MASK)

#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_MASK  (0xF0U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_SHIFT (4U)
/*! Y0_X1 - Y0_X1 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_MASK)

#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_MASK  (0xF00U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_SHIFT (8U)
/*! Y0_X2 - Y0_X2 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_MASK)

#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_MASK  (0xF000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_SHIFT (12U)
/*! Y0_X3 - Y0_X3 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_MASK)

#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_MASK  (0xF0000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_SHIFT (16U)
/*! Y1_X0 - Y1_X0 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_MASK)

#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_MASK  (0xF00000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_SHIFT (20U)
/*! Y1_X1 - Y1_X1 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_MASK)

