nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
/*! @name CURSORFOREGROUND - Cursor Foreground Color */
/*! @{ */

#define LCDIF_CURSORFOREGROUND_BLUE_MASK         (0xFFU)
#define LCDIF_CURSORFOREGROUND_BLUE_SHIFT        (0U)
/*! BLUE - Blue */
#define LCDIF_CURSORFOREGROUND_BLUE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_CURSORFOREGROUND_BLUE_SHIFT)) & LCDIF_CURSORFOREGROUND_BLUE_MASK)

#define LCDIF_CURSORFOREGROUND_GREEN_MASK        (0xFF00U)
#define LCDIF_CURSORFOREGROUND_GREEN_SHIFT       (8U)
/*! GREEN - Green */
#define LCDIF_CURSORFOREGROUND_GREEN(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_CURSORFOREGROUND_GREEN_SHIFT)) & LCDIF_CURSORFOREGROUND_GREEN_MASK)

#define LCDIF_CURSORFOREGROUND_RED_MASK          (0xFF0000U)
#define LCDIF_CURSORFOREGROUND_RED_SHIFT         (16U)
/*! RED - Red */
#define LCDIF_CURSORFOREGROUND_RED(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_CURSORFOREGROUND_RED_SHIFT)) & LCDIF_CURSORFOREGROUND_RED_MASK)
/*! @} */

/*! @name DISPLAYINTR - Display Interrupt */
/*! @{ */

#define LCDIF_DISPLAYINTR_DISP0_MASK             (0x1U)
#define LCDIF_DISPLAYINTR_DISP0_SHIFT            (0U)
/*! DISP0 - Display_0 */
#define LCDIF_DISPLAYINTR_DISP0(x)               (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTR_DISP0_SHIFT)) & LCDIF_DISPLAYINTR_DISP0_MASK)

#define LCDIF_DISPLAYINTR_DISP0_DBI_CFG_ERROR_MASK (0x1000U)
#define LCDIF_DISPLAYINTR_DISP0_DBI_CFG_ERROR_SHIFT (12U)
/*! DISP0_DBI_CFG_ERROR - Display_0 DBI Configure Error */
#define LCDIF_DISPLAYINTR_DISP0_DBI_CFG_ERROR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTR_DISP0_DBI_CFG_ERROR_SHIFT)) & LCDIF_DISPLAYINTR_DISP0_DBI_CFG_ERROR_MASK)

#define LCDIF_DISPLAYINTR_PANEL_UNDERFLOW_MASK   (0x20000000U)
#define LCDIF_DISPLAYINTR_PANEL_UNDERFLOW_SHIFT  (29U)
/*! PANEL_UNDERFLOW - Panel Underflow */
#define LCDIF_DISPLAYINTR_PANEL_UNDERFLOW(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTR_PANEL_UNDERFLOW_SHIFT)) & LCDIF_DISPLAYINTR_PANEL_UNDERFLOW_MASK)

#define LCDIF_DISPLAYINTR_SOFT_RESET_DONE_MASK   (0x40000000U)
#define LCDIF_DISPLAYINTR_SOFT_RESET_DONE_SHIFT  (30U)
/*! SOFT_RESET_DONE - Soft Reset Done */
#define LCDIF_DISPLAYINTR_SOFT_RESET_DONE(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTR_SOFT_RESET_DONE_SHIFT)) & LCDIF_DISPLAYINTR_SOFT_RESET_DONE_MASK)

#define LCDIF_DISPLAYINTR_BUS_ERROR_MASK         (0x80000000U)
#define LCDIF_DISPLAYINTR_BUS_ERROR_SHIFT        (31U)
/*! BUS_ERROR - Bus Error */
#define LCDIF_DISPLAYINTR_BUS_ERROR(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTR_BUS_ERROR_SHIFT)) & LCDIF_DISPLAYINTR_BUS_ERROR_MASK)
/*! @} */

/*! @name DISPLAYINTRENABLE - Display Interrupt Enable */
/*! @{ */

#define LCDIF_DISPLAYINTRENABLE_DISP0_MASK       (0x1U)
#define LCDIF_DISPLAYINTRENABLE_DISP0_SHIFT      (0U)
/*! DISP0 - Display_0
 *  0b0..Enables Display_0 interrupt.
 *  0b1..Disables Display_0 interrupt.
 */
#define LCDIF_DISPLAYINTRENABLE_DISP0(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTRENABLE_DISP0_SHIFT)) & LCDIF_DISPLAYINTRENABLE_DISP0_MASK)

#define LCDIF_DISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_MASK (0x1000U)
#define LCDIF_DISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_SHIFT (12U)
/*! DISP0_DBI_CFG_ERROR - Display_0 DBI Configuration Error
 *  0b0..Enables Display_0 DBI configuration error.
 *  0b1..Disables Display_0 DBI configuration error.
 */
#define LCDIF_DISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_SHIFT)) & LCDIF_DISPLAYINTRENABLE_DISP0_DBI_CFG_ERROR_MASK)

#define LCDIF_DISPLAYINTRENABLE_PANEL_UNDERFLOW_MASK (0x20000000U)
#define LCDIF_DISPLAYINTRENABLE_PANEL_UNDERFLOW_SHIFT (29U)
/*! PANEL_UNDERFLOW - Panel Underflow
 *  0b0..Enables panel underflow interrupt.
 *  0b1..Disables panel underflow interrupt.
 */
#define LCDIF_DISPLAYINTRENABLE_PANEL_UNDERFLOW(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTRENABLE_PANEL_UNDERFLOW_SHIFT)) & LCDIF_DISPLAYINTRENABLE_PANEL_UNDERFLOW_MASK)

#define LCDIF_DISPLAYINTRENABLE_SOFT_RESET_DONE_MASK (0x40000000U)
#define LCDIF_DISPLAYINTRENABLE_SOFT_RESET_DONE_SHIFT (30U)
/*! SOFT_RESET_DONE - Soft Reset Done
 *  0b0..Disables soft reset done interrupt.
 *  0b1..Enables soft reset done interrupt.
 */
#define LCDIF_DISPLAYINTRENABLE_SOFT_RESET_DONE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTRENABLE_SOFT_RESET_DONE_SHIFT)) & LCDIF_DISPLAYINTRENABLE_SOFT_RESET_DONE_MASK)

#define LCDIF_DISPLAYINTRENABLE_BUS_ERROR_MASK   (0x80000000U)
#define LCDIF_DISPLAYINTRENABLE_BUS_ERROR_SHIFT  (31U)
/*! BUS_ERROR - Bus Error
 *  0b0..Enables bus error interrupt.
 *  0b1..Disables bus error interrupt.
 */
#define LCDIF_DISPLAYINTRENABLE_BUS_ERROR(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYINTRENABLE_BUS_ERROR_SHIFT)) & LCDIF_DISPLAYINTRENABLE_BUS_ERROR_MASK)
/*! @} */

/*! @name DBICONFIG0 - DBI Configuration */
/*! @{ */

#define LCDIF_DBICONFIG0_DBI_TYPE_MASK           (0x3U)
#define LCDIF_DBICONFIG0_DBI_TYPE_SHIFT          (0U)
/*! DBI_TYPE - DBI Type
 *  0b00..Selects DBI Type A Fixed E mode.
 *  0b01..Selects DBI Type A Clocked E mode.
 *  0b10..Selects DBI type B.
 */
#define LCDIF_DBICONFIG0_DBI_TYPE(x)             (((uint32_t)(((uint32_t)(x)) << LCDIF_DBICONFIG0_DBI_TYPE_SHIFT)) & LCDIF_DBICONFIG0_DBI_TYPE_MASK)

#define LCDIF_DBICONFIG0_DBI_DATA_FORMAT_MASK    (0x3CU)
#define LCDIF_DBICONFIG0_DBI_DATA_FORMAT_SHIFT   (2U)
/*! DBI_DATA_FORMAT - DBI Data Format
 *  0b0000..D8R3G3B2
 *  0b0001..D8R4G4B4
 *  0b0010..D8R5G6B5
 *  0b0011..D8R6G6B6
 *  0b0100..D8R8G8B8
 *  0b0101..D9R6G6B6
 *  0b0110..D16R3G3B2
 *  0b0111..D16R4G4B4
 *  0b1000..D16R5G6B5
 *  0b1001..D16_R6_G6_B6_OP1
 *  0b1010..D16_R6_G6_B6_OP2
 *  0b1011..D16_R8_G8_B8_OP1
 *  0b1100..D16_R8_G8_B8_OP2
 */
#define LCDIF_DBICONFIG0_DBI_DATA_FORMAT(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_DBICONFIG0_DBI_DATA_FORMAT_SHIFT)) & LCDIF_DBICONFIG0_DBI_DATA_FORMAT_MASK)

#define LCDIF_DBICONFIG0_BUS_OUTPUT_SEL_MASK     (0x40U)
#define LCDIF_DBICONFIG0_BUS_OUTPUT_SEL_SHIFT    (6U)
/*! BUS_OUTPUT_SEL - Output Bus Select
 *  0b0..Uses DPI bus.
 *  0b1..Uses DBI bus.
 */
#define LCDIF_DBICONFIG0_BUS_OUTPUT_SEL(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_DBICONFIG0_BUS_OUTPUT_SEL_SHIFT)) & LCDIF_DBICONFIG0_BUS_OUTPUT_SEL_MASK)

