nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define LPSPI_TDR_DATA_MASK                      (0xFFFFFFFFU)
#define LPSPI_TDR_DATA_SHIFT                     (0U)
/*! DATA - Transmit Data */
#define LPSPI_TDR_DATA(x)                        (((uint32_t)(((uint32_t)(x)) << LPSPI_TDR_DATA_SHIFT)) & LPSPI_TDR_DATA_MASK)
/*! @} */

/*! @name RSR - Receive Status */
/*! @{ */

#define LPSPI_RSR_SOF_MASK                       (0x1U)
#define LPSPI_RSR_SOF_SHIFT                      (0U)
/*! SOF - Start of Frame
 *  0b0..Subsequent data word or RX FIFO is empty (RXEMPTY=1).
 *  0b1..First data word
 */
#define LPSPI_RSR_SOF(x)                         (((uint32_t)(((uint32_t)(x)) << LPSPI_RSR_SOF_SHIFT)) & LPSPI_RSR_SOF_MASK)

#define LPSPI_RSR_RXEMPTY_MASK                   (0x2U)
#define LPSPI_RSR_RXEMPTY_SHIFT                  (1U)
/*! RXEMPTY - RX FIFO Empty
 *  0b0..Not empty
 *  0b1..Empty
 */
#define LPSPI_RSR_RXEMPTY(x)                     (((uint32_t)(((uint32_t)(x)) << LPSPI_RSR_RXEMPTY_SHIFT)) & LPSPI_RSR_RXEMPTY_MASK)
/*! @} */

/*! @name RDR - Receive Data */
/*! @{ */

#define LPSPI_RDR_DATA_MASK                      (0xFFFFFFFFU)
#define LPSPI_RDR_DATA_SHIFT                     (0U)
/*! DATA - Receive Data */
#define LPSPI_RDR_DATA(x)                        (((uint32_t)(((uint32_t)(x)) << LPSPI_RDR_DATA_SHIFT)) & LPSPI_RDR_DATA_MASK)
/*! @} */

/*! @name RDROR - Receive Data Read Only */
/*! @{ */

#define LPSPI_RDROR_DATA_MASK                    (0xFFFFFFFFU)
#define LPSPI_RDROR_DATA_SHIFT                   (0U)
/*! DATA - Receive Data */
#define LPSPI_RDROR_DATA(x)                      (((uint32_t)(((uint32_t)(x)) << LPSPI_RDROR_DATA_SHIFT)) & LPSPI_RDROR_DATA_MASK)
/*! @} */

/*! @name TCBR - Transmit Command Burst */
/*! @{ */

#define LPSPI_TCBR_DATA_MASK                     (0xFFFFFFFFU)
#define LPSPI_TCBR_DATA_SHIFT                    (0U)
/*! DATA - Command Data */
#define LPSPI_TCBR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << LPSPI_TCBR_DATA_SHIFT)) & LPSPI_TCBR_DATA_MASK)
/*! @} */

/*! @name TDBR - Transmit Data Burst */
/*! @{ */

#define LPSPI_TDBR_DATA_MASK                     (0xFFFFFFFFU)
#define LPSPI_TDBR_DATA_SHIFT                    (0U)
/*! DATA - Data */
#define LPSPI_TDBR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << LPSPI_TDBR_DATA_SHIFT)) & LPSPI_TDBR_DATA_MASK)
/*! @} */

/* The count of LPSPI_TDBR */
#define LPSPI_TDBR_COUNT                         (128U)

/*! @name RDBR - Receive Data Burst */
/*! @{ */

#define LPSPI_RDBR_DATA_MASK                     (0xFFFFFFFFU)
#define LPSPI_RDBR_DATA_SHIFT                    (0U)
/*! DATA - Data */
#define LPSPI_RDBR_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << LPSPI_RDBR_DATA_SHIFT)) & LPSPI_RDBR_DATA_MASK)
/*! @} */

/* The count of LPSPI_RDBR */
#define LPSPI_RDBR_COUNT                         (128U)


/*!
 * @}
 */ /* end of group LPSPI_Register_Masks */


/* LPSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE                             (0x50484000u)
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE_NS                          (0x40484000u)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14                                  ((LPSPI_Type *)LPSPI14_BASE)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14_NS                               ((LPSPI_Type *)LPSPI14_BASE_NS)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE                             (0x50405000u)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE_NS                          (0x40405000u)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16                                  ((LPSPI_Type *)LPSPI16_BASE)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16_NS                               ((LPSPI_Type *)LPSPI16_BASE_NS)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE                             (0x50326000u)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE_NS                          (0x40326000u)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17                                  ((LPSPI_Type *)LPSPI17_BASE)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17_NS                               ((LPSPI_Type *)LPSPI17_BASE_NS)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE                             (0x50327000u)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE_NS                          (0x40327000u)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18                                  ((LPSPI_Type *)LPSPI18_BASE)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18_NS                               ((LPSPI_Type *)LPSPI18_BASE_NS)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE                             (0x50328000u)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE_NS                          (0x40328000u)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19                                  ((LPSPI_Type *)LPSPI19_BASE)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19_NS                               ((LPSPI_Type *)LPSPI19_BASE_NS)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE                             (0x50329000u)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE_NS                          (0x40329000u)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20                                  ((LPSPI_Type *)LPSPI20_BASE)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20_NS                               ((LPSPI_Type *)LPSPI20_BASE_NS)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE, 0u, LPSPI16_BASE, LPSPI17_BASE, LPSPI18_BASE, LPSPI19_BASE, LPSPI20_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14, (LPSPI_Type *)0u, LPSPI16, LPSPI17, LPSPI18, LPSPI19, LPSPI20 }
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS_NS                      { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE_NS, 0u, LPSPI16_BASE_NS, LPSPI17_BASE_NS, LPSPI18_BASE_NS, LPSPI19_BASE_NS, LPSPI20_BASE_NS }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS_NS                       { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14_NS, (LPSPI_Type *)0u, LPSPI16_NS, LPSPI17_NS, LPSPI18_NS, LPSPI19_NS, LPSPI20_NS }
#else
  /** Peripheral LPSPI14 base address */
  #define LPSPI14_BASE                             (0x40484000u)
  /** Peripheral LPSPI14 base pointer */
  #define LPSPI14                                  ((LPSPI_Type *)LPSPI14_BASE)
  /** Peripheral LPSPI16 base address */
  #define LPSPI16_BASE                             (0x40405000u)
  /** Peripheral LPSPI16 base pointer */
  #define LPSPI16                                  ((LPSPI_Type *)LPSPI16_BASE)
  /** Peripheral LPSPI17 base address */
  #define LPSPI17_BASE                             (0x40326000u)
  /** Peripheral LPSPI17 base pointer */
  #define LPSPI17                                  ((LPSPI_Type *)LPSPI17_BASE)
  /** Peripheral LPSPI18 base address */
  #define LPSPI18_BASE                             (0x40327000u)
  /** Peripheral LPSPI18 base pointer */
  #define LPSPI18                                  ((LPSPI_Type *)LPSPI18_BASE)
  /** Peripheral LPSPI19 base address */
  #define LPSPI19_BASE                             (0x40328000u)
  /** Peripheral LPSPI19 base pointer */
  #define LPSPI19                                  ((LPSPI_Type *)LPSPI19_BASE)
  /** Peripheral LPSPI20 base address */
  #define LPSPI20_BASE                             (0x40329000u)
  /** Peripheral LPSPI20 base pointer */
  #define LPSPI20                                  ((LPSPI_Type *)LPSPI20_BASE)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LPSPI14_BASE, 0u, LPSPI16_BASE, LPSPI17_BASE, LPSPI18_BASE, LPSPI19_BASE, LPSPI20_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, (LPSPI_Type *)0u, LPSPI14, (LPSPI_Type *)0u, LPSPI16, LPSPI17, LPSPI18, LPSPI19, LPSPI20 }
#endif
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }

/*!
 * @}
 */ /* end of group LPSPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- LPUART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPUART Peripheral Access Layer
 * @{
 */

/** LPUART - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  __IO uint32_t GLOBAL;                            /**< Global, offset: 0x8 */
  __IO uint32_t PINCFG;                            /**< Pin Configuration, offset: 0xC */
  __IO uint32_t BAUD;                              /**< Baud Rate, offset: 0x10 */
  __IO uint32_t STAT;                              /**< Status, offset: 0x14 */
  __IO uint32_t CTRL;                              /**< Control, offset: 0x18 */
  __IO uint32_t DATA;                              /**< Data, offset: 0x1C */
  __IO uint32_t MATCH;                             /**< Match Address, offset: 0x20 */
  __IO uint32_t MODIR;                             /**< MODEM IrDA, offset: 0x24 */
  __IO uint32_t FIFO;                              /**< FIFO, offset: 0x28 */
  __IO uint32_t WATER;                             /**< Watermark, offset: 0x2C */
  __I  uint32_t DATARO;                            /**< Data Read-Only, offset: 0x30 */
       uint8_t RESERVED_0[460];
  __O  uint32_t TCBR[128];                         /**< Transmit Command Burst, array offset: 0x200, array step: 0x4 */
  __O  uint32_t TDBR[256];                         /**< Transmit Data Burst, array offset: 0x400, array step: 0x4 */
} LPUART_Type;

/* ----------------------------------------------------------------------------
   -- LPUART Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Register_Masks LPUART Register Masks
 * @{
 */

