nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define NIC_READ_QOS_READ_QOS_MASK               (0xFU)
#define NIC_READ_QOS_READ_QOS_SHIFT              (0U)
/*! READ_QOS - Read Channel QoS Value
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_READ_QOS_READ_QOS(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_READ_QOS_READ_QOS_SHIFT)) & NIC_READ_QOS_READ_QOS_MASK)
/*! @} */

/* The count of NIC_READ_QOS */
#define NIC_READ_QOS_COUNT                       (10U)

/*! @name WRITE_QOS - Write Channel QoS Value */
/*! @{ */

#define NIC_WRITE_QOS_WRITE_QOS_MASK             (0xFU)
#define NIC_WRITE_QOS_WRITE_QOS_SHIFT            (0U)
/*! WRITE_QOS - Write channel QoS value
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_WRITE_QOS_WRITE_QOS(x)               (((uint32_t)(((uint32_t)(x)) << NIC_WRITE_QOS_WRITE_QOS_SHIFT)) & NIC_WRITE_QOS_WRITE_QOS_MASK)
/*! @} */

/* The count of NIC_WRITE_QOS */
#define NIC_WRITE_QOS_COUNT                      (10U)

/*! @name FN_MOD - Issuing Functionality Modification */
/*! @{ */

#define NIC_FN_MOD_FN_MOD_MASK                   (0x3U)
#define NIC_FN_MOD_FN_MOD_SHIFT                  (0U)
/*! FN_MOD - Issuing Functionality Modification
 *  0b00..Default issuing
 *  0b01..Read issuing
 *  0b10..Write issuing
 *  0b11..Read and write issuing
 */
#define NIC_FN_MOD_FN_MOD(x)                     (((uint32_t)(((uint32_t)(x)) << NIC_FN_MOD_FN_MOD_SHIFT)) & NIC_FN_MOD_FN_MOD_MASK)
/*! @} */

/* The count of NIC_FN_MOD */
#define NIC_FN_MOD_COUNT                         (10U)

/*! @name QOS_CNTL - QoS Control */
/*! @{ */

#define NIC_QOS_CNTL_EN_AW_RATE_MASK             (0x1U)
#define NIC_QOS_CNTL_EN_AW_RATE_SHIFT            (0U)
/*! EN_AW_RATE - Enable AW Transaction Rate Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AW_RATE(x)               (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AW_RATE_SHIFT)) & NIC_QOS_CNTL_EN_AW_RATE_MASK)

#define NIC_QOS_CNTL_EN_AR_RATE_MASK             (0x2U)
#define NIC_QOS_CNTL_EN_AR_RATE_SHIFT            (1U)
/*! EN_AR_RATE - Enable AR Transaction Rate Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AR_RATE(x)               (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AR_RATE_SHIFT)) & NIC_QOS_CNTL_EN_AR_RATE_MASK)

#define NIC_QOS_CNTL_EN_AWAR_RATE_MASK           (0x4U)
#define NIC_QOS_CNTL_EN_AWAR_RATE_SHIFT          (2U)
/*! EN_AWAR_RATE - Enable Combined AW And AR Transaction Rate Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AWAR_RATE(x)             (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AWAR_RATE_SHIFT)) & NIC_QOS_CNTL_EN_AWAR_RATE_MASK)

#define NIC_QOS_CNTL_EN_AW_FC_MASK               (0x8U)
#define NIC_QOS_CNTL_EN_AW_FC_SHIFT              (3U)
/*! EN_AW_FC - Enable AW Feedback Control Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AW_FC(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AW_FC_SHIFT)) & NIC_QOS_CNTL_EN_AW_FC_MASK)

#define NIC_QOS_CNTL_EN_AR_FC_MASK               (0x10U)
#define NIC_QOS_CNTL_EN_AR_FC_SHIFT              (4U)
/*! EN_AR_FC - Enable AR Feedback Control Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AR_FC(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AR_FC_SHIFT)) & NIC_QOS_CNTL_EN_AR_FC_MASK)

#define NIC_QOS_CNTL_EN_AW_OT_MASK               (0x20U)
#define NIC_QOS_CNTL_EN_AW_OT_SHIFT              (5U)
/*! EN_AW_OT - Enable AW Outstanding Transaction Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AW_OT(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AW_OT_SHIFT)) & NIC_QOS_CNTL_EN_AW_OT_MASK)

#define NIC_QOS_CNTL_EN_AR_OT_MASK               (0x40U)
#define NIC_QOS_CNTL_EN_AR_OT_SHIFT              (6U)
/*! EN_AR_OT - Enable AR Outstanding Transaction Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AR_OT(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AR_OT_SHIFT)) & NIC_QOS_CNTL_EN_AR_OT_MASK)

#define NIC_QOS_CNTL_EN_AWAR_OT_MASK             (0x80U)
#define NIC_QOS_CNTL_EN_AWAR_OT_SHIFT            (7U)
/*! EN_AWAR_OT - Enable AW/AR Outstanding Transaction Regulation
 *  0b0..Disables
 *  0b1..Enables
 */
#define NIC_QOS_CNTL_EN_AWAR_OT(x)               (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_EN_AWAR_OT_SHIFT)) & NIC_QOS_CNTL_EN_AWAR_OT_MASK)

#define NIC_QOS_CNTL_MODE_AW_FC_MASK             (0x10000U)
#define NIC_QOS_CNTL_MODE_AW_FC_SHIFT            (16U)
/*! MODE_AW_FC - AW Feedback Control Mode
 *  0b0..Transaction latency
 *  0b1..Address latency
 */
#define NIC_QOS_CNTL_MODE_AW_FC(x)               (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_MODE_AW_FC_SHIFT)) & NIC_QOS_CNTL_MODE_AW_FC_MASK)

#define NIC_QOS_CNTL_MODE_AR_FC_MASK             (0x100000U)
#define NIC_QOS_CNTL_MODE_AR_FC_SHIFT            (20U)
/*! MODE_AR_FC - AR Feedback Control Mode
 *  0b0..Transaction latency
 *  0b1..Address latency
 */
#define NIC_QOS_CNTL_MODE_AR_FC(x)               (((uint32_t)(((uint32_t)(x)) << NIC_QOS_CNTL_MODE_AR_FC_SHIFT)) & NIC_QOS_CNTL_MODE_AR_FC_MASK)
/*! @} */

/* The count of NIC_QOS_CNTL */
#define NIC_QOS_CNTL_COUNT                       (10U)

/*! @name MAX_OT - Maximum Number of Outstanding Transactions */
/*! @{ */

#define NIC_MAX_OT_AW_MAX_OTF_MASK               (0xFFU)
#define NIC_MAX_OT_AW_MAX_OTF_SHIFT              (0U)
/*! AW_MAX_OTF - Fractional Part of Maximum Outstanding AW Addresses */
#define NIC_MAX_OT_AW_MAX_OTF(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_MAX_OT_AW_MAX_OTF_SHIFT)) & NIC_MAX_OT_AW_MAX_OTF_MASK)

#define NIC_MAX_OT_AW_MAX_OTI_MASK               (0x3F00U)
#define NIC_MAX_OT_AW_MAX_OTI_SHIFT              (8U)
/*! AW_MAX_OTI - Integer Part of Maximum Outstanding AW Addresses */
#define NIC_MAX_OT_AW_MAX_OTI(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_MAX_OT_AW_MAX_OTI_SHIFT)) & NIC_MAX_OT_AW_MAX_OTI_MASK)

#define NIC_MAX_OT_AR_MAX_OTF_MASK               (0xFF0000U)
#define NIC_MAX_OT_AR_MAX_OTF_SHIFT              (16U)
/*! AR_MAX_OTF - Fractional Part of Maximum Outstanding AR Addresses */
#define NIC_MAX_OT_AR_MAX_OTF(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_MAX_OT_AR_MAX_OTF_SHIFT)) & NIC_MAX_OT_AR_MAX_OTF_MASK)

#define NIC_MAX_OT_AR_MAX_OTI_MASK               (0x3F000000U)
#define NIC_MAX_OT_AR_MAX_OTI_SHIFT              (24U)
/*! AR_MAX_OTI - Integer Part of Maximum Outstanding AR Addresses */
#define NIC_MAX_OT_AR_MAX_OTI(x)                 (((uint32_t)(((uint32_t)(x)) << NIC_MAX_OT_AR_MAX_OTI_SHIFT)) & NIC_MAX_OT_AR_MAX_OTI_MASK)
/*! @} */

