nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define PMC_PDCFGSTATUS2_SRAM28_MASK             (0x10000000U)
#define PMC_PDCFGSTATUS2_SRAM28_SHIFT            (28U)
/*! SRAM28 - RAM Partition 28 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM28(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM28_SHIFT)) & PMC_PDCFGSTATUS2_SRAM28_MASK)

#define PMC_PDCFGSTATUS2_SRAM29_MASK             (0x20000000U)
#define PMC_PDCFGSTATUS2_SRAM29_SHIFT            (29U)
/*! SRAM29 - RAM Partition 29 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM29(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM29_SHIFT)) & PMC_PDCFGSTATUS2_SRAM29_MASK)
/*! @} */

/*! @name PDCFGSTATUS3 - PD Configuration Status 3 */
/*! @{ */

#define PMC_PDCFGSTATUS3_SRAM0_MASK              (0x1U)
#define PMC_PDCFGSTATUS3_SRAM0_SHIFT             (0U)
/*! SRAM0 - RAM Partition 0 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM0(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM0_SHIFT)) & PMC_PDCFGSTATUS3_SRAM0_MASK)

#define PMC_PDCFGSTATUS3_SRAM1_MASK              (0x2U)
#define PMC_PDCFGSTATUS3_SRAM1_SHIFT             (1U)
/*! SRAM1 - RAM Partition 1 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM1(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM1_SHIFT)) & PMC_PDCFGSTATUS3_SRAM1_MASK)

#define PMC_PDCFGSTATUS3_SRAM2_MASK              (0x4U)
#define PMC_PDCFGSTATUS3_SRAM2_SHIFT             (2U)
/*! SRAM2 - RAM Partition 2 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM2(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM2_SHIFT)) & PMC_PDCFGSTATUS3_SRAM2_MASK)

#define PMC_PDCFGSTATUS3_SRAM3_MASK              (0x8U)
#define PMC_PDCFGSTATUS3_SRAM3_SHIFT             (3U)
/*! SRAM3 - RAM Partition 3 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM3(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM3_SHIFT)) & PMC_PDCFGSTATUS3_SRAM3_MASK)

#define PMC_PDCFGSTATUS3_SRAM4_MASK              (0x10U)
#define PMC_PDCFGSTATUS3_SRAM4_SHIFT             (4U)
/*! SRAM4 - RAM Partition 4 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM4(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM4_SHIFT)) & PMC_PDCFGSTATUS3_SRAM4_MASK)

#define PMC_PDCFGSTATUS3_SRAM5_MASK              (0x20U)
#define PMC_PDCFGSTATUS3_SRAM5_SHIFT             (5U)
/*! SRAM5 - RAM Partition 5 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM5(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM5_SHIFT)) & PMC_PDCFGSTATUS3_SRAM5_MASK)

#define PMC_PDCFGSTATUS3_SRAM6_MASK              (0x40U)
#define PMC_PDCFGSTATUS3_SRAM6_SHIFT             (6U)
/*! SRAM6 - RAM Partition 6 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM6(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM6_SHIFT)) & PMC_PDCFGSTATUS3_SRAM6_MASK)

#define PMC_PDCFGSTATUS3_SRAM7_MASK              (0x80U)
#define PMC_PDCFGSTATUS3_SRAM7_SHIFT             (7U)
/*! SRAM7 - RAM Partition 7 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM7(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM7_SHIFT)) & PMC_PDCFGSTATUS3_SRAM7_MASK)

#define PMC_PDCFGSTATUS3_SRAM8_MASK              (0x100U)
#define PMC_PDCFGSTATUS3_SRAM8_SHIFT             (8U)
/*! SRAM8 - RAM Partition 8 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM8(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM8_SHIFT)) & PMC_PDCFGSTATUS3_SRAM8_MASK)

#define PMC_PDCFGSTATUS3_SRAM9_MASK              (0x200U)
#define PMC_PDCFGSTATUS3_SRAM9_SHIFT             (9U)
/*! SRAM9 - RAM Partition 9 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM9(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM9_SHIFT)) & PMC_PDCFGSTATUS3_SRAM9_MASK)

#define PMC_PDCFGSTATUS3_SRAM10_MASK             (0x400U)
#define PMC_PDCFGSTATUS3_SRAM10_SHIFT            (10U)
/*! SRAM10 - RAM Partition 10 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM10(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM10_SHIFT)) & PMC_PDCFGSTATUS3_SRAM10_MASK)

#define PMC_PDCFGSTATUS3_SRAM11_MASK             (0x800U)
#define PMC_PDCFGSTATUS3_SRAM11_SHIFT            (11U)
/*! SRAM11 - RAM Partition 11 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM11(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM11_SHIFT)) & PMC_PDCFGSTATUS3_SRAM11_MASK)

#define PMC_PDCFGSTATUS3_SRAM12_MASK             (0x1000U)
#define PMC_PDCFGSTATUS3_SRAM12_SHIFT            (12U)
/*! SRAM12 - RAM Partition 12 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM12(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM12_SHIFT)) & PMC_PDCFGSTATUS3_SRAM12_MASK)

#define PMC_PDCFGSTATUS3_SRAM13_MASK             (0x2000U)
#define PMC_PDCFGSTATUS3_SRAM13_SHIFT            (13U)
/*! SRAM13 - RAM Partition 13 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM13(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM13_SHIFT)) & PMC_PDCFGSTATUS3_SRAM13_MASK)

#define PMC_PDCFGSTATUS3_SRAM14_MASK             (0x4000U)
#define PMC_PDCFGSTATUS3_SRAM14_SHIFT            (14U)
/*! SRAM14 - RAM Partition 14 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM14(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM14_SHIFT)) & PMC_PDCFGSTATUS3_SRAM14_MASK)

#define PMC_PDCFGSTATUS3_SRAM15_MASK             (0x8000U)
#define PMC_PDCFGSTATUS3_SRAM15_SHIFT            (15U)
/*! SRAM15 - RAM Partition 15 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM15(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM15_SHIFT)) & PMC_PDCFGSTATUS3_SRAM15_MASK)

