nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define PMC_PDCFGSTATUS5_XSPI0_MASK              (0x40000U)
#define PMC_PDCFGSTATUS5_XSPI0_SHIFT             (18U)
/*! XSPI0 - XSPI0, MMU0, and Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_XSPI0(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_XSPI0_SHIFT)) & PMC_PDCFGSTATUS5_XSPI0_MASK)

#define PMC_PDCFGSTATUS5_XSPI1_MASK              (0x80000U)
#define PMC_PDCFGSTATUS5_XSPI1_SHIFT             (19U)
/*! XSPI1 - XSPI1, MMU1, and Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_XSPI1(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_XSPI1_SHIFT)) & PMC_PDCFGSTATUS5_XSPI1_MASK)

#define PMC_PDCFGSTATUS5_XSPI2_MASK              (0x100000U)
#define PMC_PDCFGSTATUS5_XSPI2_SHIFT             (20U)
/*! XSPI2 - XSPI2 and MMU2 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_XSPI2(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_XSPI2_SHIFT)) & PMC_PDCFGSTATUS5_XSPI2_MASK)

#define PMC_PDCFGSTATUS5_LCD_MASK                (0x200000U)
#define PMC_PDCFGSTATUS5_LCD_SHIFT               (21U)
/*! LCD - LCDIF Controller RAMs Periphery
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS5_LCD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_LCD_SHIFT)) & PMC_PDCFGSTATUS5_LCD_MASK)

#define PMC_PDCFGSTATUS5_OCOTP_MASK              (0x400000U)
#define PMC_PDCFGSTATUS5_OCOTP_SHIFT             (22U)
/*! OCOTP - OCOTP Shadow SRAM
 *  0b1..Array Power Down
 *  0b0..Array Powered
 */
#define PMC_PDCFGSTATUS5_OCOTP(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_OCOTP_SHIFT)) & PMC_PDCFGSTATUS5_OCOTP_MASK)
/*! @} */

/*! @name PDWAKECFG - PD Wake-up Configuration for Sense Domain */
/*! @{ */

#define PMC_PDWAKECFG_RBB1KP_MASK                (0x1U)
#define PMC_PDWAKECFG_RBB1KP_SHIFT               (0U)
/*! RBB1KP - RBB Wake-up in VDD1 Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_RBB1KP(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_RBB1KP_SHIFT)) & PMC_PDWAKECFG_RBB1KP_MASK)

#define PMC_PDWAKECFG_RBB2KP_MASK                (0x2U)
#define PMC_PDWAKECFG_RBB2KP_SHIFT               (1U)
/*! RBB2KP - RBB Wake-up in VDD2 Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_RBB2KP(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_RBB2KP_SHIFT)) & PMC_PDWAKECFG_RBB2KP_MASK)

#define PMC_PDWAKECFG_RBBNKP_MASK                (0x4U)
#define PMC_PDWAKECFG_RBBNKP_SHIFT               (2U)
/*! RBBNKP - RBB Wake-up in VDDN Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_RBBNKP(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_RBBNKP_SHIFT)) & PMC_PDWAKECFG_RBBNKP_MASK)

#define PMC_PDWAKECFG_AFBB1KP_MASK               (0x100U)
#define PMC_PDWAKECFG_AFBB1KP_SHIFT              (8U)
/*! AFBB1KP - AFBB Wake-up in VDD1 Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_AFBB1KP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_AFBB1KP_SHIFT)) & PMC_PDWAKECFG_AFBB1KP_MASK)

#define PMC_PDWAKECFG_AFBB2KP_MASK               (0x200U)
#define PMC_PDWAKECFG_AFBB2KP_SHIFT              (9U)
/*! AFBB2KP - AFBB Wake-up in VDD2Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_AFBB2KP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_AFBB2KP_SHIFT)) & PMC_PDWAKECFG_AFBB2KP_MASK)

#define PMC_PDWAKECFG_AFBBNKP_MASK               (0x400U)
#define PMC_PDWAKECFG_AFBBNKP_SHIFT              (10U)
/*! AFBBNKP - AFBB Wake-up in VDDN Domain
 *  0b0..Do not copy during Deep Sleep
 *  0b1..Copy during Deep Sleep
 */
#define PMC_PDWAKECFG_AFBBNKP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDWAKECFG_AFBBNKP_SHIFT)) & PMC_PDWAKECFG_AFBBNKP_MASK)
/*! @} */

/*! @name PWRFLAGS - Power Domain Flags for Sense Domain */
/*! @{ */

#define PMC_PWRFLAGS_V1SENSF_MASK                (0x1U)
#define PMC_PWRFLAGS_V1SENSF_SHIFT               (0U)
/*! V1SENSF - VDD1_SENSE Domain Flag
 *  0b1..DSR event occurred
 *  0b0..No DSR event occurred
 */
#define PMC_PWRFLAGS_V1SENSF(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V1SENSF_SHIFT)) & PMC_PWRFLAGS_V1SENSF_MASK)

#define PMC_PWRFLAGS_V2COMPF_MASK                (0x2U)
#define PMC_PWRFLAGS_V2COMPF_SHIFT               (1U)
/*! V2COMPF - VDD2_COMP Domain Flag
 *  0b1..DSR event occurred
 *  0b0..No DSR event occurred
 */
#define PMC_PWRFLAGS_V2COMPF(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2COMPF_SHIFT)) & PMC_PWRFLAGS_V2COMPF_MASK)

#define PMC_PWRFLAGS_V2NMEDF_MASK                (0x4U)
#define PMC_PWRFLAGS_V2NMEDF_SHIFT               (2U)
/*! V2NMEDF - VDD2_MEDIA and VDDN_MEDIA Domain Flag
 *  0b1..DSR event occurred
 *  0b0..No DSR event occurred
 */
#define PMC_PWRFLAGS_V2NMEDF(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2NMEDF_SHIFT)) & PMC_PWRFLAGS_V2NMEDF_MASK)

#define PMC_PWRFLAGS_V2COMF_MASK                 (0x8U)
#define PMC_PWRFLAGS_V2COMF_SHIFT                (3U)
/*! V2COMF - VDD2_COM Domain Flag
 *  0b1..DSR event occurred
 *  0b0..No DSR event occurred
 */
#define PMC_PWRFLAGS_V2COMF(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2COMF_SHIFT)) & PMC_PWRFLAGS_V2COMF_MASK)

#define PMC_PWRFLAGS_VNCOMF_MASK                 (0x10U)
#define PMC_PWRFLAGS_VNCOMF_SHIFT                (4U)
/*! VNCOMF - VDDN_COM Domain Flag
 *  0b1..DSR event occurred
 *  0b0..No DSR event occurred
 */
#define PMC_PWRFLAGS_VNCOMF(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_VNCOMF_SHIFT)) & PMC_PWRFLAGS_VNCOMF_MASK)

#define PMC_PWRFLAGS_V2DSPF_MASK                 (0x20U)
#define PMC_PWRFLAGS_V2DSPF_SHIFT                (5U)
/*! V2DSPF - VDD2_DSP Domain Flag
 *  0b1..Power-down event occurred
 *  0b0..No power-down event occurred
 */
#define PMC_PWRFLAGS_V2DSPF(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PWRFLAGS_V2DSPF_SHIFT)) & PMC_PWRFLAGS_V2DSPF_MASK)

