nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM20_MASK  (0x200U)
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM20_SHIFT (9U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM20(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM20_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_LP_FLEXCOMM20_MASK)

#define RSTCTL1_PRSTCTL0_CLR_SAI3_MASK           (0x400U)
#define RSTCTL1_PRSTCTL0_CLR_SAI3_SHIFT          (10U)
/*! SAI3 - SAI3 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_SAI3(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_SAI3_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_SAI3_MASK)

#define RSTCTL1_PRSTCTL0_CLR_I3C2_MASK           (0x800U)
#define RSTCTL1_PRSTCTL0_CLR_I3C2_SHIFT          (11U)
/*! I3C2 - I3C2 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_I3C2(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_I3C2_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_I3C2_MASK)

#define RSTCTL1_PRSTCTL0_CLR_I3C3_MASK           (0x1000U)
#define RSTCTL1_PRSTCTL0_CLR_I3C3_SHIFT          (12U)
/*! I3C3 - I3C3 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_I3C3(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_I3C3_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_I3C3_MASK)

#define RSTCTL1_PRSTCTL0_CLR_GPIO8_MASK          (0x2000U)
#define RSTCTL1_PRSTCTL0_CLR_GPIO8_SHIFT         (13U)
/*! GPIO8 - GPIO8 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_GPIO8(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_GPIO8_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_GPIO8_MASK)

#define RSTCTL1_PRSTCTL0_CLR_GPIO9_MASK          (0x4000U)
#define RSTCTL1_PRSTCTL0_CLR_GPIO9_SHIFT         (14U)
/*! GPIO9 - GPIO9 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_GPIO9(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_GPIO9_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_GPIO9_MASK)

#define RSTCTL1_PRSTCTL0_CLR_GPIO10_MASK         (0x8000U)
#define RSTCTL1_PRSTCTL0_CLR_GPIO10_SHIFT        (15U)
/*! GPIO10 - GPIO10 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_GPIO10(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_GPIO10_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_GPIO10_MASK)

#define RSTCTL1_PRSTCTL0_CLR_PINT1_MASK          (0x10000U)
#define RSTCTL1_PRSTCTL0_CLR_PINT1_SHIFT         (16U)
/*! PINT1 - PINT1 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_PINT1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_PINT1_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_PINT1_MASK)

#define RSTCTL1_PRSTCTL0_CLR_CTIMER5_MASK        (0x20000U)
#define RSTCTL1_PRSTCTL0_CLR_CTIMER5_SHIFT       (17U)
/*! CTIMER5 - CTIMER5 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_CTIMER5(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_CTIMER5_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_CTIMER5_MASK)

#define RSTCTL1_PRSTCTL0_CLR_CTIMER6_MASK        (0x40000U)
#define RSTCTL1_PRSTCTL0_CLR_CTIMER6_SHIFT       (18U)
/*! CTIMER6 - CTIMER6 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_CTIMER6(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_CTIMER6_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_CTIMER6_MASK)

#define RSTCTL1_PRSTCTL0_CLR_CTIMER7_MASK        (0x80000U)
#define RSTCTL1_PRSTCTL0_CLR_CTIMER7_SHIFT       (19U)
/*! CTIMER7 - CTIMER7 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_CTIMER7(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_CTIMER7_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_CTIMER7_MASK)

#define RSTCTL1_PRSTCTL0_CLR_MRT1_MASK           (0x100000U)
#define RSTCTL1_PRSTCTL0_CLR_MRT1_SHIFT          (20U)
/*! MRT1 - MRT1 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_MRT1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_MRT1_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_MRT1_MASK)

#define RSTCTL1_PRSTCTL0_CLR_UTICK1_MASK         (0x200000U)
#define RSTCTL1_PRSTCTL0_CLR_UTICK1_SHIFT        (21U)
/*! UTICK1 - UTICK1 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_UTICK1(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_UTICK1_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_UTICK1_MASK)

#define RSTCTL1_PRSTCTL0_CLR_MU3_MASK            (0x1000000U)
#define RSTCTL1_PRSTCTL0_CLR_MU3_SHIFT           (24U)
/*! MU3 - MU3 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_MU3(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_MU3_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_MU3_MASK)

#define RSTCTL1_PRSTCTL0_CLR_SEMA42_3_MASK       (0x2000000U)
#define RSTCTL1_PRSTCTL0_CLR_SEMA42_3_SHIFT      (25U)
/*! SEMA42_3 - SEMA42_3 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_SEMA42_3(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_SEMA42_3_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_SEMA42_3_MASK)

#define RSTCTL1_PRSTCTL0_CLR_PVT1_MASK           (0x10000000U)
#define RSTCTL1_PRSTCTL0_CLR_PVT1_SHIFT          (28U)
/*! PVT1 - PVT1 Reset
 *  0b1..Clears reset.
 *  0b0..No effect
 */
#define RSTCTL1_PRSTCTL0_CLR_PVT1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL1_PRSTCTL0_CLR_PVT1_SHIFT)) & RSTCTL1_PRSTCTL0_CLR_PVT1_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RSTCTL1_Register_Masks */


/* RSTCTL1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RSTCTL1 base address */
  #define RSTCTL1_BASE                             (0x50040000u)
  /** Peripheral RSTCTL1 base address */
  #define RSTCTL1_BASE_NS                          (0x40040000u)
  /** Peripheral RSTCTL1 base pointer */
  #define RSTCTL1                                  ((RSTCTL1_Type *)RSTCTL1_BASE)
  /** Peripheral RSTCTL1 base pointer */
  #define RSTCTL1_NS                               ((RSTCTL1_Type *)RSTCTL1_BASE_NS)
  /** Array initializer of RSTCTL1 peripheral base addresses */
  #define RSTCTL1_BASE_ADDRS                       { RSTCTL1_BASE }
  /** Array initializer of RSTCTL1 peripheral base pointers */
  #define RSTCTL1_BASE_PTRS                        { RSTCTL1 }
  /** Array initializer of RSTCTL1 peripheral base addresses */
  #define RSTCTL1_BASE_ADDRS_NS                    { RSTCTL1_BASE_NS }
  /** Array initializer of RSTCTL1 peripheral base pointers */
  #define RSTCTL1_BASE_PTRS_NS                     { RSTCTL1_NS }
#else
  /** Peripheral RSTCTL1 base address */
  #define RSTCTL1_BASE                             (0x40040000u)
  /** Peripheral RSTCTL1 base pointer */
  #define RSTCTL1                                  ((RSTCTL1_Type *)RSTCTL1_BASE)
  /** Array initializer of RSTCTL1 peripheral base addresses */
  #define RSTCTL1_BASE_ADDRS                       { RSTCTL1_BASE }
  /** Array initializer of RSTCTL1 peripheral base pointers */
  #define RSTCTL1_BASE_PTRS                        { RSTCTL1 }
#endif

/*!
 * @}
 */ /* end of group RSTCTL1_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RSTCTL2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL2_Peripheral_Access_Layer RSTCTL2 Peripheral Access Layer
 * @{
 */

/** RSTCTL2 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PRSTCTL0;                          /**< VDDN Domain Peripheral Reset Control 0, offset: 0x10 */
       uint8_t RESERVED_1[44];
  __O  uint32_t PRSTCTL0_SET;                      /**< VDDN Domain Peripheral Reset Control 0 SET, offset: 0x40 */
       uint8_t RESERVED_2[44];
  __O  uint32_t PRSTCTL0_CLR;                      /**< VDDN Domain Peripheral Reset Control 0 CLR, offset: 0x70 */
} RSTCTL2_Type;

/* ----------------------------------------------------------------------------
   -- RSTCTL2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL2_Register_Masks RSTCTL2 Register Masks
 * @{
 */

/*! @name PRSTCTL0 - VDDN Domain Peripheral Reset Control 0 */
/*! @{ */

#define RSTCTL2_PRSTCTL0_IOPCTL2_MASK            (0x2U)
#define RSTCTL2_PRSTCTL0_IOPCTL2_SHIFT           (1U)
/*! IOPCTL2 - IOPCTL2 Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL2_PRSTCTL0_IOPCTL2(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL2_PRSTCTL0_IOPCTL2_SHIFT)) & RSTCTL2_PRSTCTL0_IOPCTL2_MASK)
/*! @} */

/*! @name PRSTCTL0_SET - VDDN Domain Peripheral Reset Control 0 SET */
/*! @{ */

