nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define RSTCTL3_PRSTCTL1_MU0_MASK                (0x2U)
#define RSTCTL3_PRSTCTL1_MU0_SHIFT               (1U)
/*! MU0 - MU0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_MU0(x)                  (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_MU0_SHIFT)) & RSTCTL3_PRSTCTL1_MU0_MASK)

#define RSTCTL3_PRSTCTL1_MU1_MASK                (0x4U)
#define RSTCTL3_PRSTCTL1_MU1_SHIFT               (2U)
/*! MU1 - MU1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_MU1(x)                  (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_MU1_SHIFT)) & RSTCTL3_PRSTCTL1_MU1_MASK)

#define RSTCTL3_PRSTCTL1_MU2_MASK                (0x8U)
#define RSTCTL3_PRSTCTL1_MU2_SHIFT               (3U)
/*! MU2 - MU2 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_MU2(x)                  (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_MU2_SHIFT)) & RSTCTL3_PRSTCTL1_MU2_MASK)

#define RSTCTL3_PRSTCTL1_SEMA42_0_MASK           (0x20U)
#define RSTCTL3_PRSTCTL1_SEMA42_0_SHIFT          (5U)
/*! SEMA42_0 - SEMA42_0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SEMA42_0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SEMA42_0_SHIFT)) & RSTCTL3_PRSTCTL1_SEMA42_0_MASK)

#define RSTCTL3_PRSTCTL1_ADC0_MASK               (0x40U)
#define RSTCTL3_PRSTCTL1_ADC0_SHIFT              (6U)
/*! ADC0 - ADC0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_ADC0(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_ADC0_SHIFT)) & RSTCTL3_PRSTCTL1_ADC0_MASK)

#define RSTCTL3_PRSTCTL1_SDADC_MASK              (0x80U)
#define RSTCTL3_PRSTCTL1_SDADC_SHIFT             (7U)
/*! SDADC - SDADC Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SDADC(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SDADC_SHIFT)) & RSTCTL3_PRSTCTL1_SDADC_MASK)

#define RSTCTL3_PRSTCTL1_ACMP0_MASK              (0x100U)
#define RSTCTL3_PRSTCTL1_ACMP0_SHIFT             (8U)
/*! ACMP0 - ACMP0 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_ACMP0(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_ACMP0_SHIFT)) & RSTCTL3_PRSTCTL1_ACMP0_MASK)

#define RSTCTL3_PRSTCTL1_MICFIL_MASK             (0x200U)
#define RSTCTL3_PRSTCTL1_MICFIL_SHIFT            (9U)
/*! MICFIL - MICFIL Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_MICFIL(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_MICFIL_SHIFT)) & RSTCTL3_PRSTCTL1_MICFIL_MASK)

#define RSTCTL3_PRSTCTL1_INPUTMUX1_MASK          (0x4000U)
#define RSTCTL3_PRSTCTL1_INPUTMUX1_SHIFT         (14U)
/*! INPUTMUX1 - INPUTMUX1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_INPUTMUX1(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_INPUTMUX1_SHIFT)) & RSTCTL3_PRSTCTL1_INPUTMUX1_MASK)

#define RSTCTL3_PRSTCTL1_LPI2C15_MASK            (0x40000U)
#define RSTCTL3_PRSTCTL1_LPI2C15_SHIFT           (18U)
/*! LPI2C15 - LPI2C15 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_LPI2C15(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_LPI2C15_SHIFT)) & RSTCTL3_PRSTCTL1_LPI2C15_MASK)
/*! @} */

/*! @name PRSTCTL0_SET - Sense Domain Peripheral Reset Control 0 SET */
/*! @{ */

#define RSTCTL3_PRSTCTL0_SET_IOPCTL1_MASK        (0x1U)
#define RSTCTL3_PRSTCTL0_SET_IOPCTL1_SHIFT       (0U)
/*! IOPCTL1 - IOPCTL1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL0_SET_IOPCTL1(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_SET_IOPCTL1_SHIFT)) & RSTCTL3_PRSTCTL0_SET_IOPCTL1_MASK)

#define RSTCTL3_PRSTCTL0_SET_CPU1_MASK           (0x80000000U)
#define RSTCTL3_PRSTCTL0_SET_CPU1_SHIFT          (31U)
/*! CPU1 - CPU1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL0_SET_CPU1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_SET_CPU1_SHIFT)) & RSTCTL3_PRSTCTL0_SET_CPU1_MASK)
/*! @} */

/*! @name PRSTCTL1_SET - Sense Domain Peripheral Reset Control 1 SET */
/*! @{ */

#define RSTCTL3_PRSTCTL1_SET_MU0_MASK            (0x2U)
#define RSTCTL3_PRSTCTL1_SET_MU0_SHIFT           (1U)
/*! MU0 - MU0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_MU0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_MU0_SHIFT)) & RSTCTL3_PRSTCTL1_SET_MU0_MASK)

#define RSTCTL3_PRSTCTL1_SET_MU1_MASK            (0x4U)
#define RSTCTL3_PRSTCTL1_SET_MU1_SHIFT           (2U)
/*! MU1 - MU1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_MU1(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_MU1_SHIFT)) & RSTCTL3_PRSTCTL1_SET_MU1_MASK)

#define RSTCTL3_PRSTCTL1_SET_MU2_MASK            (0x8U)
#define RSTCTL3_PRSTCTL1_SET_MU2_SHIFT           (3U)
/*! MU2 - MU2 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_MU2(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_MU2_SHIFT)) & RSTCTL3_PRSTCTL1_SET_MU2_MASK)

#define RSTCTL3_PRSTCTL1_SET_SEMA42_0_MASK       (0x20U)
#define RSTCTL3_PRSTCTL1_SET_SEMA42_0_SHIFT      (5U)
/*! SEMA42_0 - SEMA42_0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_SEMA42_0(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_SEMA42_0_SHIFT)) & RSTCTL3_PRSTCTL1_SET_SEMA42_0_MASK)

#define RSTCTL3_PRSTCTL1_SET_ADC0_MASK           (0x40U)
#define RSTCTL3_PRSTCTL1_SET_ADC0_SHIFT          (6U)
/*! ADC0 - ADC0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_ADC0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_ADC0_SHIFT)) & RSTCTL3_PRSTCTL1_SET_ADC0_MASK)

#define RSTCTL3_PRSTCTL1_SET_SDADC_MASK          (0x80U)
#define RSTCTL3_PRSTCTL1_SET_SDADC_SHIFT         (7U)
/*! SDADC - SDADC Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_SDADC(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_SDADC_SHIFT)) & RSTCTL3_PRSTCTL1_SET_SDADC_MASK)

#define RSTCTL3_PRSTCTL1_SET_ACMP0_MASK          (0x100U)
#define RSTCTL3_PRSTCTL1_SET_ACMP0_SHIFT         (8U)
/*! ACMP0 - ACMP0 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_ACMP0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_ACMP0_SHIFT)) & RSTCTL3_PRSTCTL1_SET_ACMP0_MASK)

#define RSTCTL3_PRSTCTL1_SET_MICFIL_MASK         (0x200U)
#define RSTCTL3_PRSTCTL1_SET_MICFIL_SHIFT        (9U)
/*! MICFIL - MICFIL Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_MICFIL(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_MICFIL_SHIFT)) & RSTCTL3_PRSTCTL1_SET_MICFIL_MASK)

