nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM17_MASK (0x800U)
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM17_SHIFT (11U)
/*! LP_FLEXCOMM17 - LP_FLEXCOMM17 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM17(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM17_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM17_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM18_MASK (0x1000U)
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM18_SHIFT (12U)
/*! LP_FLEXCOMM18 - LP_FLEXCOMM18 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM18(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM18_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM18_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM19_MASK (0x2000U)
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM19_SHIFT (13U)
/*! LP_FLEXCOMM19 - LP_FLEXCOMM19 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM19(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM19_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM19_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM20_MASK (0x4000U)
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM20_SHIFT (14U)
/*! LP_FLEXCOMM20 - LP_FLEXCOMM20 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM20(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM20_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_LP_FLEXCOMM20_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_ADC0_MASK        (0x8000U)
#define SLEEPCON1_WAKEUPEN0_CLR_ADC0_SHIFT       (15U)
/*! ADC0 - ADC0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_ADC0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_ADC0_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_ADC0_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_ACMP0_MASK       (0x40000U)
#define SLEEPCON1_WAKEUPEN0_CLR_ACMP0_SHIFT      (18U)
/*! ACMP0 - ACMP0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_ACMP0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_ACMP0_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_ACMP0_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_RD_ERR_MASK (0x80000U)
#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_RD_ERR_SHIFT (19U)
/*! MICFIL_RD_ERR - MICFIL Read Data Error Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_RD_ERR(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_MICFIL_RD_ERR_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_MICFIL_RD_ERR_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_WKUP_MASK (0x400000U)
#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_WKUP_SHIFT (22U)
/*! MICFIL_WKUP - MICFIL Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_MICFIL_WKUP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_MICFIL_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_MICFIL_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_ALARM_MASK  (0x800000U)
#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_ALARM_SHIFT (23U)
/*! RTC1_ALARM - RTC1_ALARM Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_ALARM(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_RTC1_ALARM_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_RTC1_ALARM_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_WKUP_MASK   (0x1000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_WKUP_SHIFT  (24U)
/*! RTC1_WKUP - RTC1_WKUP Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_RTC1_WKUP(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_RTC1_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_RTC1_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_MU1_MUB_MASK     (0x4000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_MU1_MUB_SHIFT    (26U)
/*! MU1_MUB - MU1_MUB Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_MU1_MUB(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_MU1_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_MU1_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_MU2_MUB_MASK     (0x8000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_MU2_MUB_SHIFT    (27U)
/*! MU2_MUB - MU2_MUB Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_MU2_MUB(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_MU2_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_MU2_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_MU3_MUA_MASK     (0x10000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_MU3_MUA_SHIFT    (28U)
/*! MU3_MUA - MU3_MUA Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_MU3_MUA(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_MU3_MUA_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_MU3_MUA_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_PMC1_MASK        (0x20000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_PMC1_SHIFT       (29U)
/*! PMC1 - PMC1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_PMC1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_PMC1_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_PMC1_MASK)

#define SLEEPCON1_WAKEUPEN0_CLR_OSTIMER_MASK     (0x40000000U)
#define SLEEPCON1_WAKEUPEN0_CLR_OSTIMER_SHIFT    (30U)
/*! OSTIMER - OSTIMER Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN0_CLR_OSTIMER(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_CLR_OSTIMER_SHIFT)) & SLEEPCON1_WAKEUPEN0_CLR_OSTIMER_MASK)
/*! @} */

/*! @name WAKEUPEN1_CLR - Wakeup Enable 1 Clear */
/*! @{ */

#define SLEEPCON1_WAKEUPEN1_CLR_I3C2_MASK        (0x2U)
#define SLEEPCON1_WAKEUPEN1_CLR_I3C2_SHIFT       (1U)
/*! I3C2 - I3C2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_I3C2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_I3C2_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_I3C2_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_USB0_MASK        (0x4U)
#define SLEEPCON1_WAKEUPEN1_CLR_USB0_SHIFT       (2U)
/*! USB0 - USB0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_USB0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_USB0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_USB0_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_USB1_MASK        (0x8U)
#define SLEEPCON1_WAKEUPEN1_CLR_USB1_SHIFT       (3U)
/*! USB1 - USB1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_USB1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_USB1_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_USB1_MASK)

