nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH3_MASK   (0x1000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH3_SHIFT  (24U)
/*! EDMA3_CH3 - eDMA3 Channel 3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH3(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH3_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH3_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH4_MASK   (0x2000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH4_SHIFT  (25U)
/*! EDMA3_CH4 - eDMA3 Channel 4 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH4(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH4_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH4_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH5_MASK   (0x4000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH5_SHIFT  (26U)
/*! EDMA3_CH5 - eDMA3 Channel 5 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH5(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH5_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH5_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH6_MASK   (0x8000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH6_SHIFT  (27U)
/*! EDMA3_CH6 - eDMA3 Channel 6 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH6(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH6_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH6_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH7_MASK   (0x10000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH7_SHIFT  (28U)
/*! EDMA3_CH7 - eDMA3_INTR7 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH7(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH7_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_EDMA3_CH7_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH0_MASK   (0x20000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH0_SHIFT  (29U)
/*! GPIO8_CH0 - GPIO8 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH0_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH1_MASK   (0x40000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH1_SHIFT  (30U)
/*! GPIO8_CH1 - GPIO8 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_GPIO8_CH1_MASK)

#define SLEEPCON1_WAKEUPEN1_CLR_GPIO9_CH0_MASK   (0x80000000U)
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO9_CH0_SHIFT  (31U)
/*! GPIO9_CH0 - GPIO9 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN1_CLR_GPIO9_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_CLR_GPIO9_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_CLR_GPIO9_CH0_MASK)
/*! @} */

/*! @name WAKEUPEN2_CLR - Wakeup Enable 2 Clear */
/*! @{ */

#define SLEEPCON1_WAKEUPEN2_CLR_GPIO9_CH1_MASK   (0x1U)
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO9_CH1_SHIFT  (0U)
/*! GPIO9_CH1 - GPIO9 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO9_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_GPIO9_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_GPIO9_CH1_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH0_MASK  (0x2U)
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH0_SHIFT (1U)
/*! GPIO10_CH0 - GPIO10 Channel 0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH0(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH0_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH1_MASK  (0x4U)
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH1_SHIFT (2U)
/*! GPIO10_CH1 - GPIO10 Channel 1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH1(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_GPIO10_CH1_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR0_MASK (0x20U)
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR0_SHIFT (5U)
/*! PINT1_INTR0 - PINT1_INTR0 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR0(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR0_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR0_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR1_MASK (0x40U)
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR1_SHIFT (6U)
/*! PINT1_INTR1 - PINT1_INTR1 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR1(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR1_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR1_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR2_MASK (0x80U)
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR2_SHIFT (7U)
/*! PINT1_INTR2 - PINT1_INTR2 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR2(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR2_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR2_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR3_MASK (0x100U)
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR3_SHIFT (8U)
/*! PINT1_INTR3 - PINT1_INTR3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR3(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR3_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_PINT1_INTR3_MASK)

#define SLEEPCON1_WAKEUPEN2_CLR_SAI3_MASK        (0x200U)
#define SLEEPCON1_WAKEUPEN2_CLR_SAI3_SHIFT       (9U)
/*! SAI3 - SAI3 Wake-up Enable Clear
 *  0b0..No effect
 *  0b1..Clears the bit
 */
#define SLEEPCON1_WAKEUPEN2_CLR_SAI3(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN2_CLR_SAI3_SHIFT)) & SLEEPCON1_WAKEUPEN2_CLR_SAI3_MASK)
/*! @} */

/*! @name LPOSC_DELAY - LPOSC Delay */
/*! @{ */

#define SLEEPCON1_LPOSC_DELAY_LPOSCDELAY_MASK    (0xFFFFU)
#define SLEEPCON1_LPOSC_DELAY_LPOSCDELAY_SHIFT   (0U)
/*! LPOSCDELAY - Delay value for LPOSC output */
#define SLEEPCON1_LPOSC_DELAY_LPOSCDELAY(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LPOSC_DELAY_LPOSCDELAY_SHIFT)) & SLEEPCON1_LPOSC_DELAY_LPOSCDELAY_MASK)
/*! @} */

/*! @name PWRDOWN_WAIT - Power Down Wait */
/*! @{ */

