nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/MIMXRT798S_hifi1.h
#define SYSCON1_EDMA2_EN0_CTIMER5_M0_EN_MASK     (0x100U)
#define SYSCON1_EDMA2_EN0_CTIMER5_M0_EN_SHIFT    (8U)
/*! CTIMER5_M0_EN - CTIMER5 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER5_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER5_M0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER5_M0_EN_MASK)

#define SYSCON1_EDMA2_EN0_CTIMER5_M1_EN_MASK     (0x200U)
#define SYSCON1_EDMA2_EN0_CTIMER5_M1_EN_SHIFT    (9U)
/*! CTIMER5_M1_EN - CTIMER5 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER5_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER5_M1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER5_M1_EN_MASK)

#define SYSCON1_EDMA2_EN0_CTIMER6_M0_EN_MASK     (0x400U)
#define SYSCON1_EDMA2_EN0_CTIMER6_M0_EN_SHIFT    (10U)
/*! CTIMER6_M0_EN - CTIMER6 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER6_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER6_M0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER6_M0_EN_MASK)

#define SYSCON1_EDMA2_EN0_CTIMER6_M1_EN_MASK     (0x800U)
#define SYSCON1_EDMA2_EN0_CTIMER6_M1_EN_SHIFT    (11U)
/*! CTIMER6_M1_EN - CTIMER6 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER6_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER6_M1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER6_M1_EN_MASK)

#define SYSCON1_EDMA2_EN0_CTIMER7_M0_EN_MASK     (0x1000U)
#define SYSCON1_EDMA2_EN0_CTIMER7_M0_EN_SHIFT    (12U)
/*! CTIMER7_M0_EN - CTIMER7 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER7_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER7_M0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER7_M0_EN_MASK)

#define SYSCON1_EDMA2_EN0_CTIMER7_M1_EN_MASK     (0x2000U)
#define SYSCON1_EDMA2_EN0_CTIMER7_M1_EN_SHIFT    (13U)
/*! CTIMER7_M1_EN - CTIMER7 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_CTIMER7_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_CTIMER7_M1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_CTIMER7_M1_EN_MASK)

#define SYSCON1_EDMA2_EN0_ADC0_FIFO0_EN_MASK     (0x4000U)
#define SYSCON1_EDMA2_EN0_ADC0_FIFO0_EN_SHIFT    (14U)
/*! ADC0_FIFO0_EN - ADC0 FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_ADC0_FIFO0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_ADC0_FIFO0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_ADC0_FIFO0_EN_MASK)

#define SYSCON1_EDMA2_EN0_ADC0_FIFO1_EN_MASK     (0x8000U)
#define SYSCON1_EDMA2_EN0_ADC0_FIFO1_EN_SHIFT    (15U)
/*! ADC0_FIFO1_EN - ADC0 FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_ADC0_FIFO1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_ADC0_FIFO1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_ADC0_FIFO1_EN_MASK)

#define SYSCON1_EDMA2_EN0_SDADC_FIFO0_EN_MASK    (0x10000U)
#define SYSCON1_EDMA2_EN0_SDADC_FIFO0_EN_SHIFT   (16U)
/*! SDADC_FIFO0_EN - SDADC FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_SDADC_FIFO0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_SDADC_FIFO0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_SDADC_FIFO0_EN_MASK)

#define SYSCON1_EDMA2_EN0_SDADC_FIFO1_EN_MASK    (0x20000U)
#define SYSCON1_EDMA2_EN0_SDADC_FIFO1_EN_SHIFT   (17U)
/*! SDADC_FIFO1_EN - SDADC FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_SDADC_FIFO1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_SDADC_FIFO1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_SDADC_FIFO1_EN_MASK)

#define SYSCON1_EDMA2_EN0_SDADC_FIFO2_EN_MASK    (0x40000U)
#define SYSCON1_EDMA2_EN0_SDADC_FIFO2_EN_SHIFT   (18U)
/*! SDADC_FIFO2_EN - SDADC FIFO2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_SDADC_FIFO2_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_SDADC_FIFO2_EN_SHIFT)) & SYSCON1_EDMA2_EN0_SDADC_FIFO2_EN_MASK)

#define SYSCON1_EDMA2_EN0_SDADC_FIFO3_EN_MASK    (0x80000U)
#define SYSCON1_EDMA2_EN0_SDADC_FIFO3_EN_SHIFT   (19U)
/*! SDADC_FIFO3_EN - SDADC FIFO3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_SDADC_FIFO3_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_SDADC_FIFO3_EN_SHIFT)) & SYSCON1_EDMA2_EN0_SDADC_FIFO3_EN_MASK)

#define SYSCON1_EDMA2_EN0_ACMP_EN_MASK           (0x100000U)
#define SYSCON1_EDMA2_EN0_ACMP_EN_SHIFT          (20U)
/*! ACMP_EN - ACMP0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_ACMP_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_ACMP_EN_SHIFT)) & SYSCON1_EDMA2_EN0_ACMP_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_MASK (0x800000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_SHIFT (23U)
/*! FLEXIO_SHFT_TIMER0_EN - FLEXIO Shift Timer 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER0_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_MASK (0x1000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_SHIFT (24U)
/*! FLEXIO_SHFT_TIMER1_EN - FLEXIO Shift Timer 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER1_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_MASK (0x2000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_SHIFT (25U)
/*! FLEXIO_SHFT_TIMER2_EN - FLEXIO Shift Timer 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER2_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_MASK (0x4000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_SHIFT (26U)
/*! FLEXIO_SHFT_TIMER3_EN - FLEXIO Shift Timer 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER3_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_MASK (0x8000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_SHIFT (27U)
/*! FLEXIO_SHFT_TIMER4_EN - FLEXIO Shift Timer 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER4_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_MASK (0x10000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_SHIFT (28U)
/*! FLEXIO_SHFT_TIMER5_EN - FLEXIO Shift Timer 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER5_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_MASK (0x20000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_SHIFT (29U)
/*! FLEXIO_SHFT_TIMER6_EN - FLEXIO Shift Timer 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER6_EN_MASK)

#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_MASK (0x40000000U)
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_SHIFT (30U)
/*! FLEXIO_SHFT_TIMER7_EN - FLEXIO Shift Timer 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_SHIFT)) & SYSCON1_EDMA2_EN0_FLEXIO_SHFT_TIMER7_EN_MASK)

#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_MASK (0x80000000U)
#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_SHIFT (31U)
/*! LP_FLEXCOMM17_RX_EN - LP_FLEXCOMM17 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN0_LP_FLEXCOMM17_RX_EN_MASK)
/*! @} */

/*! @name EDMA2_EN1 - eDMA2 Request Enable 1 */
/*! @{ */

